{"survey_title": "Procuring Artificial Intelligence (November 21, 2018) Global results", "survey_date": "November 21, 2018", "survey_location": "Collaboration Lounge, Académie De-La-Salle, 373 Sussex Drive (Guigues Avenue entrance), Ottawa, Ontarioand available across Canada by webcast", "date_last_scraped": "12/24/18", "total_number_of_questions": 17, "processed_number_of_questions": 19, "date_generated": "10-02-19", "question_index": {"Question": {"1": "1. Overall, I was satisfied with this learning event.\n ", "2": "2. I was satisfied with the content of this learning event (e.g. accuracy, currency, relevance).\n ", "3": "3. I was satisfied with the materials (e.g. manual, presentation, hand-outs) used in this learning event.", "4": "4. The learning event was well structured (e.g. length, pace, flow of information).", "5": "5. This learning event was a worthwhile investment for my employer.", "6": "6. The learning objectives were met.", "7": "7. Did you attend this learning event  through Webcast?", "8": "7a. The Webcast was an appropriate delivery method for this content.", "9": "7b. The level of technical support provided for this learning event was appropriate.", "10": "8a1. This session was effective.\n ", "11": "8b1. This session was effective.\n ", "12": "9. Please rate your level of knowledge in the subject area.", "12a": "a) Before this event activity.", "12b": "b) After this event activity. ", "13": "11. How did you learn about this learning event? (select all that apply)\n ", "14": "12a. Your current classification group:\n ", "15": "12b. Your current classification level:\n ", "16": "13. How long have you been in your current job?\n ", "17": "I allow my comments to be used anonymously for promotional purposes\n "}}, "sentiment_score": 0.0301587295437616, "magnitude_score": 62.79999992251396, "number_of_comment_sections": 5, "number_of_comments": 63, "number_of_sentences": 152, "number_of_words": 2132, "comments": {"language": {"10-0": "en", "10-1": "en", "10-2": "en", "10-3": "en", "10-4": "en", "10-5": "en", "10-6": "en", "10-7": "en", "10-8": "fr", "10-9": "en", "10-10": "en", "10-11": "en", "10-12": "en", "10-13": "en", "10-14": "fr", "10-15": "en", "10-16": "en", "10-17": "en", "10-18": "en", "10-19": "en", "10-20": "en", "10-21": "fr", "10-22": "en", "10-23": "en", "11-0": "en", "11-1": "en", "11-2": "en", "11-3": "en", "11-4": "en", "11-5": "en", "11-6": "fr", "11-7": "en", "11-8": "en", "11-9": "en", "11-10": "fr", "11-11": "en", "11-12": "en", "11-13": "fr", "11-14": "en", "11-15": "en", "11-16": "en", "11-17": "en", "11-18": "en", "11-19": "en", "11-20": "en", "11-21": "en", "12-0": "en", "12-1": "en", "12-2": "en", "12-3": "fr", "12-4": "fr", "12-5": "en", "12-6": "en", "12-7": "en", "13-0": "en", "13-1": "en", "13-2": "en", "16-0": "en", "16-1": "en", "16-2": "en", "16-3": "en", "16-4": "en", "16-5": "en"}, "comment": {"10-0": "Appreciated receiving test email the day before the event.  The test link worked.  Unfortunately the actual link for the event did not work.  So sadly I have missed the event.  Hoping that the presentation portion may be sent out at latter time for viewing when I have a moment.  I was really hoping to increase my knowledge of digital and how we as PS are moving forward in this space.", "10-1": "How do we become engaged with enabling digital services in the GC? By learning what the GC is doing to become a digital leader is a start. Attending and actively participating at sessions such as these help evolve our thinking by becoming more informed about the emerging needs of tomorrow. Simply thinking of possibilities and understanding limitations is a big step towards understanding the level of effort required in order to modernize GC services. It's not a paradigm shift. The need to reflect services that are modern and efficient has always existed. GC tends to be more static in nature because of the complexity of its organizational structure. Sessions such as these only scratches the surface of what we can do to enhance our knowledge of AI and its potential.", "10-2": "No content, basic info, we could have found better speakers.", "10-3": "The event that was placed in my lessons in GcCampus did not contain the link for the WebEx. My supervisor and I all the sections of the event and we were unable to find it. Usually it's very straight forward and easy to join.", "10-4": "If possible I would like to have access to the Questions that were asked over Webcast/In House with Answers. Can these be sent to all attendees?", "10-5": "The webcast delivery was almost unwatchable due to frequently frozen video stream. I was expecting more information about actual procurement but the panel seemed mostly interested in discussing rather basic/introductory concepts about AI. The panels were otherwise very well-spoken and knowledgeable and I would have enjoyed listening regardless of how on topic they were with respect to procurement.", "10-6": "I think this is still at the concept stage so wording it as \"what you need to know to use and procure AI\" is deceptive in that there is not enough evidence (other than a pilot) that the practices are sound and the most effective.   The folks in the audience did not get a chance to ask questions since the questions that came in through email were given priority.", "10-7": "Yes, it was effective. I particularly liked Noel (one of the panelist) for providing simple and clear points delivered throughout his presentation: the general need of AI within the government and the growth of AI implications in the legal affairs as time will go by.", "10-8": "Nous aurions aimé avoir du matériel pour chaque participant et pouvoir le rapporter au bureau pour le partager avec les collègues.\nIl y avait de très bonnes questions sur Slido. J'aurais aimé qu'on prenne plus de temps pour y répondre.\nVous demandez si l'événement a rencontré les objectifs d'apprentissage. Il faudrait nous les rappeler pour pouvoir répondre à cette question.", "10-9": "Audio level on webcast was low and difficult to hear.", "10-10": "The networking opportunities were excellent as well.  I met some great CSPS people with whom I'll be following up, and public servants from other departments who are going through similar challenges.", "10-11": "The webcast was terrible. Frequent freezing, hearing multiple and different voices. No technical support. I suggest sending the video of the event to those who attend the webcast. Very interesting topic. Need more sessions on the subject.", "10-12": "Panel individuals spoke well and gave clear information - including answering the questions. Very well done by both moderator and panel.", "10-13": "The panel was very high-level and anyone who is already somewhat familiar with AI issues wouldn't have learned a lot.", "10-14": "Certains documents ont été mentionnés, présentés ou distribués au gens sur place mais ceux comme moi en webdiffusion n'avions pas accès à ces documents. Il a été mentionné que ces documents seront accessibles éventuellement mais ils auraient dû l'être durant la webdiffusion.", "10-15": "After I registered for the event I received an email asking me to test my connection to confirm that when the event occurred I would be able to see everything. I tested and confirmed. That same email said I would receive a link to the WebEx event 24 hours before it was supposed to occur. I never received this email and when I attempted to access the event through other means there were no avenues available to connect me. A co-worker was attempting to register for the event and had issues. He sent numerous emails for support and he received no response from anyone. Very unfortunate.", "10-16": "I felt the session lacked a clear focus with tangible examples. It was difficult to see how AI will fit with my area of work. I found contextualizing the information to be difficult.", "10-17": "More sessions around this topic and other emerging technologies would be very helpful.", "10-18": "The panel seemed to know little about what AI was and what it could do. They spoke in generalities about the ethics of AI and algorithmic impact assessments, but my impression was that they really didn't understand what that meant. At the end, I was certainly none the wiser.\n\nAnd, I experienced technical issues. The video froze often but I was never able to connect with audio only.", "10-19": "This information should be more widely distributed.  I am now actively trying to think of uses for AI in my area.", "10-20": "Having a person who can speak to actual experience going through this process was perfect.", "10-21": "Le titre n'était pas assez spécifique. Ce n'était pas une présentaiton sur l'utilisation de l'IA dans la fonction publique en générale, mais bien sur l'utilisation de l'IA pour créer un outil de procurement. J'aurais préféré une présentation plus générale ou un titre plus spécifique.", "10-22": "Did not participate (webinar)", "10-23": "I was only able to stay for the Panel discussion.  While there was some relevant information discussed, it would have been extremely helpful to have had documents available in paper/on screen while discussing.  Many documents were alluded to but were not available, and no follow up email has yet been issued.  The panelists clearly possessed a significant amount of information, but I felt that they did not go into sufficient detail on their experiences.", "11-0": "N/A  as I only signed up for the webinar", "11-1": "I think the concept of identifying business requirements was really interesting but unfortunately I was not able to fully focus my attention because of differing views and needs of all participants. I attempted to focus attention on identifying one need for the purposes of completing the exercise but I wasn't very successful. I'm an introvert and without a moderator that can channel collective input, I'm not the best fitted. I will try to reach out to PSPC and see if I can conduct a mock exercise that is more focused because I believe there exists a mutual learning opportunity and that my input might help inform aspects of the procurement vehicle.", "11-2": "No idea I couldn't join", "11-3": "I would love to see the results from this workshop. I had to leave a few minutes early so didn't catch the wrap up!", "11-4": "I did not watch this through webcast.", "11-5": "We didn't have time to hear what other groups wrote.", "11-6": "C'était professionnel d'avoir 4-5 personnes qui faisaient le tour des tables.", "11-7": "It would have been nice to make provisions for those attending via webcast.", "11-8": "See my comments from the previous question.  It was effective to work with a colleague's real-life challenge and go through the process of scoping it.  It was a good combination with the panel discussion.", "11-9": "I did not participate in the workshop. \nIf there are materials from this workshop, I would like to have a copy. Please and thank you!", "11-10": "Je n'ai malheureusement pas participé à l'atelier", "11-11": "I like the structure of questionnaire (it seems to be easier to start from 13 then up to 1 statement of work). However, I am still a little confused. Who should fill the questionnaire? client-end user? contracting officers? both? This is a tool. To use the tool effectively, there should be a work organization to come with and a support structure (with real people) to help user of system to troubleshoot. Thanks.", "11-12": "The most relevant part was the presentation at the beginning of the workshop where the new procurement process was presented. The workshop itself wasn't super useful. We had to get into specifics on a topic that people around the table didn't know very well.", "11-13": "Accès en webdiffusion donc exclus de la partie atelier pratique.", "11-14": "I attended via WebEx. I did not attend the practical workshop.", "11-15": "I did not attend this part.", "11-16": "Webcast participants could not participate in the in person activity re: building requirements. Hopefully further information to templates, guides etc.. will be sent out to webcast viewers on using the source list.", "11-17": "Did not attend.", "11-18": "Workshop was not part of the webcast", "11-19": "I found this workshop ok to interact with the people at my table. I would have liked to get feedback on our answers to know if we were on the right path or not.", "11-20": "Did not participate in this portion of the event", "11-21": "Unable to attend the workshop", "12-0": "Real link did not work.  See my earlier comments.", "12-1": "The combination of panel discussion and practical application was excellent.", "12-2": "You didn't give more time for panelists to answer online questions. May sahre with us if those were dealt with.", "12-3": "Je trouve que lorsque nous avons une présentation traduite, cela change beaucoup la dynamique. Ils font un très bon travail, mais le \"ton\" ne reflète pas l'interlocuteur alors cela rend la présentation plus monotone.", "12-4": "La webdiffusion à mon site (Centre de recherche de Valcartier QC) coupait sans arrêt ce qui rendait impossible de suivre l'événement. J'ai dû utiliser la téléconférence (audio seulement via ligne téléphonique).", "12-5": "In my case it would be a huge learning curve for the implementation of any AI.", "12-6": "I don't know what I don't know. It seems like the process can be quick, but unfortunately experience dictates otherwise. I am nonetheless optimistic and look forward to going through it.", "12-7": "We need more events on this subject and maybe more detailed and technical for non-specialist employees", "13-0": "Senior Management", "13-1": "Agency newsletter", "13-2": "Colleague", "16-0": "As an EX it is helpful to understand the possibilities and risks of new technologies and applications/innovations in other industries.  It help vision the possibilities in business model shifts, culture shifts and digital service transformations we need to make in PS.  Appreciate kindly more events in this area.", "16-1": "Change Management: I'd like to listen to a discussion on how the GC is building capacity (communities of practice, focus groups, working groups, learning opportunities, etc.). I'd like to understand the level of commitment from senior management in terms of engaging employees in digital enablement in the GC. For example, examining challenges and successes of talent development, training, leadership. Why aren't digital principles tied to our PMAs? Are there opportunities to encourage more flexible roles and responsibilities with respect to position criteria. Can we reform and modernize our current workforce structure? Are there policy barriers that prevent us from asking more commitment from our employees such as being digital (as a mindset) and thinking of modernization as a continuous cycle of evolution? Why aren't hiring practices more evolved? It would be extremely interesting to understand the investment needed to build our digital capacity along with challenges (perceived or real) such as impacts from union negotiations, collective agreements and our approach to hiring. I find having to constantly explain the benefits in making our data more accessible exhausting. Having to answer questions such as why modernizing our services is important and why enhancing our data state is meaningful. These suggestions are broad but I truly believe that examining the state of our workforce and thinking of how to build capacity (to fit the need of today and tomorrow) is important if we are going to be successful at becoming digitally relevant. The more we automate processes, the more important it is at examining its impact and consequences which require a human analysis.", "16-2": "Suppliers of AI can present how they can help with Government projects.", "16-3": "I look forward to a new batch of similar presentations with the Digital Academy.", "16-4": "Emerging (IT) trends that can help develop/strengthen (future) careers within the public sector.", "16-5": "- How to use AI for financial Agents\n- What skills to be learned to stay tuned with these new technologies"}, "sentiment_score": {"10-0": 0.0, "10-1": 0.4000000059604645, "10-2": -0.8999999761581421, "10-3": 0.0, "10-4": -0.20000000298023224, "10-5": -0.20000000298023224, "10-6": -0.20000000298023224, "10-7": 0.699999988079071, "10-8": 0.30000001192092896, "10-9": -0.5, "10-10": 0.800000011920929, "10-11": -0.10000000149011612, "10-12": 0.4000000059604645, "10-13": 0.0, "10-14": -0.20000000298023224, "10-15": -0.5, "10-16": -0.30000001192092896, "10-17": 0.699999988079071, "10-18": -0.30000001192092896, "10-19": 0.0, "10-20": 0.800000011920929, "10-21": -0.10000000149011612, "10-22": -0.10000000149011612, "10-23": -0.20000000298023224, "11-0": 0.0, "11-1": -0.20000000298023224, "11-2": -0.6000000238418579, "11-3": 0.10000000149011612, "11-4": -0.10000000149011612, "11-5": -0.20000000298023224, "11-6": 0.0, "11-7": 0.20000000298023224, "11-8": 0.5, "11-9": 0.0, "11-10": -0.5, "11-11": 0.10000000149011612, "11-12": 0.0, "11-13": 0.10000000149011612, "11-14": -0.20000000298023224, "11-15": 0.0, "11-16": 0.0, "11-17": -0.20000000298023224, "11-18": 0.0, "11-19": 0.10000000149011612, "11-20": -0.30000001192092896, "11-21": -0.699999988079071, "12-0": -0.30000001192092896, "12-1": 0.8999999761581421, "12-2": 0.0, "12-3": 0.10000000149011612, "12-4": -0.30000001192092896, "12-5": 0.800000011920929, "12-6": 0.0, "12-7": 0.699999988079071, "13-0": 0.0, "13-1": 0.0, "13-2": 0.0, "16-0": 0.800000011920929, "16-1": 0.20000000298023224, "16-2": 0.30000001192092896, "16-3": 0.0, "16-4": 0.10000000149011612, "16-5": 0.20000000298023224}, "magnitude_score": {"10-0": 2.0999999046325684, "10-1": 3.5, "10-2": 0.8999999761581421, "10-3": 1.600000023841858, "10-4": 0.5, "10-5": 2.4000000953674316, "10-6": 0.5, "10-7": 1.5, "10-8": 2.299999952316284, "10-9": 0.5, "10-10": 1.7000000476837158, "10-11": 3.0999999046325684, "10-12": 0.800000011920929, "10-13": 0.0, "10-14": 0.5, "10-15": 4.0, "10-16": 1.2000000476837158, "10-17": 0.699999988079071, "10-18": 2.0, "10-19": 0.30000001192092896, "10-20": 0.800000011920929, "10-21": 1.0, "10-22": 0.10000000149011612, "10-23": 2.5, "11-0": 0.0, "11-1": 1.7999999523162842, "11-2": 0.6000000238418579, "11-3": 1.100000023841858, "11-4": 0.10000000149011612, "11-5": 0.20000000298023224, "11-6": 0.0, "11-7": 0.20000000298023224, "11-8": 1.600000023841858, "11-9": 0.4000000059604645, "11-10": 0.5, "11-11": 2.0, "11-12": 1.2999999523162842, "11-13": 0.10000000149011612, "11-14": 0.5, "11-15": 0.0, "11-16": 0.4000000059604645, "11-17": 0.20000000298023224, "11-18": 0.0, "11-19": 0.6000000238418579, "11-20": 0.30000001192092896, "11-21": 0.699999988079071, "12-0": 0.699999988079071, "12-1": 0.8999999761581421, "12-2": 0.5, "12-3": 1.5, "12-4": 0.699999988079071, "12-5": 0.800000011920929, "12-6": 1.2000000476837158, "12-7": 0.699999988079071, "13-0": 0.0, "13-1": 0.0, "13-2": 0.0, "16-0": 2.5, "16-1": 5.599999904632568, "16-2": 0.30000001192092896, "16-3": 0.0, "16-4": 0.10000000149011612, "16-5": 0.20000000298023224}, "number_of_sentences": {"10-0": 6, "10-1": 8, "10-2": 1, "10-3": 3, "10-4": 2, "10-5": 3, "10-6": 2, "10-7": 2, "10-8": 5, "10-9": 1, "10-10": 2, "10-11": 6, "10-12": 2, "10-13": 1, "10-14": 2, "10-15": 7, "10-16": 3, "10-17": 1, "10-18": 5, "10-19": 2, "10-20": 1, "10-21": 3, "10-22": 1, "10-23": 4, "11-0": 1, "11-1": 4, "11-2": 1, "11-3": 2, "11-4": 1, "11-5": 1, "11-6": 1, "11-7": 1, "11-8": 3, "11-9": 3, "11-10": 1, "11-11": 8, "11-12": 3, "11-13": 1, "11-14": 2, "11-15": 1, "11-16": 2, "11-17": 1, "11-18": 1, "11-19": 2, "11-20": 1, "11-21": 1, "12-0": 2, "12-1": 1, "12-2": 2, "12-3": 2, "12-4": 2, "12-5": 1, "12-6": 3, "12-7": 1, "13-0": 1, "13-1": 1, "13-2": 1, "16-0": 3, "16-1": 13, "16-2": 1, "16-3": 1, "16-4": 1, "16-5": 1}, "number_of_words": {"10-0": 70, "10-1": 131, "10-2": 10, "10-3": 45, "10-4": 26, "10-5": 58, "10-6": 73, "10-7": 47, "10-8": 60, "10-9": 10, "10-10": 32, "10-11": 37, "10-12": 21, "10-13": 21, "10-14": 42, "10-15": 106, "10-16": 33, "10-17": 13, "10-18": 69, "10-19": 21, "10-20": 15, "10-21": 44, "10-22": 6, "10-23": 74, "11-0": 9, "11-1": 114, "11-2": 6, "11-3": 25, "11-4": 7, "11-5": 11, "11-6": 11, "11-7": 13, "11-8": 35, "11-9": 25, "11-10": 7, "11-11": 76, "11-12": 46, "11-13": 10, "11-14": 11, "11-15": 6, "11-16": 32, "11-17": 3, "11-18": 7, "11-19": 34, "11-20": 9, "11-21": 5, "12-0": 9, "12-1": 10, "12-2": 21, "12-3": 36, "12-4": 35, "12-5": 16, "12-6": 33, "12-7": 16, "13-0": 2, "13-1": 2, "13-2": 1, "16-0": 48, "16-1": 273, "16-2": 12, "16-3": 14, "16-4": 17, "16-5": 21}}, "sentences": {"comment_id": {"10-0-0": "10-0", "10-0-1": "10-0", "10-0-2": "10-0", "10-0-3": "10-0", "10-0-4": "10-0", "10-0-5": "10-0", "10-1-0": "10-1", "10-1-1": "10-1", "10-1-2": "10-1", "10-1-3": "10-1", "10-1-4": "10-1", "10-1-5": "10-1", "10-1-6": "10-1", "10-1-7": "10-1", "10-2-0": "10-2", "10-3-0": "10-3", "10-3-1": "10-3", "10-3-2": "10-3", "10-4-0": "10-4", "10-4-1": "10-4", "10-5-0": "10-5", "10-5-1": "10-5", "10-5-2": "10-5", "10-6-0": "10-6", "10-6-1": "10-6", "10-7-0": "10-7", "10-7-1": "10-7", "10-8-0": "10-8", "10-8-1": "10-8", "10-8-2": "10-8", "10-8-3": "10-8", "10-8-4": "10-8", "10-9-0": "10-9", "10-10-0": "10-10", "10-10-1": "10-10", "10-11-0": "10-11", "10-11-1": "10-11", "10-11-2": "10-11", "10-11-3": "10-11", "10-11-4": "10-11", "10-11-5": "10-11", "10-12-0": "10-12", "10-12-1": "10-12", "10-13-0": "10-13", "10-14-0": "10-14", "10-14-1": "10-14", "10-15-0": "10-15", "10-15-1": "10-15", "10-15-2": "10-15", "10-15-3": "10-15", "10-15-4": "10-15", "10-15-5": "10-15", "10-15-6": "10-15", "10-16-0": "10-16", "10-16-1": "10-16", "10-16-2": "10-16", "10-17-0": "10-17", "10-18-0": "10-18", "10-18-1": "10-18", "10-18-2": "10-18", "10-18-3": "10-18", "10-18-4": "10-18", "10-19-0": "10-19", "10-19-1": "10-19", "10-20-0": "10-20", "10-21-0": "10-21", "10-21-1": "10-21", "10-21-2": "10-21", "10-22-0": "10-22", "10-23-0": "10-23", "10-23-1": "10-23", "10-23-2": "10-23", "10-23-3": "10-23", "11-0-0": "11-0", "11-1-0": "11-1", "11-1-1": "11-1", "11-1-2": "11-1", "11-1-3": "11-1", "11-2-0": "11-2", "11-3-0": "11-3", "11-3-1": "11-3", "11-4-0": "11-4", "11-5-0": "11-5", "11-6-0": "11-6", "11-7-0": "11-7", "11-8-0": "11-8", "11-8-1": "11-8", "11-8-2": "11-8", "11-9-0": "11-9", "11-9-1": "11-9", "11-9-2": "11-9", "11-10-0": "11-10", "11-11-0": "11-11", "11-11-1": "11-11", "11-11-2": "11-11", "11-11-3": "11-11", "11-11-4": "11-11", "11-11-5": "11-11", "11-11-6": "11-11", "11-11-7": "11-11", "11-12-0": "11-12", "11-12-1": "11-12", "11-12-2": "11-12", "11-13-0": "11-13", "11-14-0": "11-14", "11-14-1": "11-14", "11-15-0": "11-15", "11-16-0": "11-16", "11-16-1": "11-16", "11-17-0": "11-17", "11-18-0": "11-18", "11-19-0": "11-19", "11-19-1": "11-19", "11-20-0": "11-20", "11-21-0": "11-21", "12-0-0": "12-0", "12-0-1": "12-0", "12-1-0": "12-1", "12-2-0": "12-2", "12-2-1": "12-2", "12-3-0": "12-3", "12-3-1": "12-3", "12-4-0": "12-4", "12-4-1": "12-4", "12-5-0": "12-5", "12-6-0": "12-6", "12-6-1": "12-6", "12-6-2": "12-6", "12-7-0": "12-7", "13-0-0": "13-0", "13-1-0": "13-1", "13-2-0": "13-2", "16-0-0": "16-0", "16-0-1": "16-0", "16-0-2": "16-0", "16-1-0": "16-1", "16-1-1": "16-1", "16-1-2": "16-1", "16-1-3": "16-1", "16-1-4": "16-1", "16-1-5": "16-1", "16-1-6": "16-1", "16-1-7": "16-1", "16-1-8": "16-1", "16-1-9": "16-1", "16-1-10": "16-1", "16-1-11": "16-1", "16-1-12": "16-1", "16-2-0": "16-2", "16-3-0": "16-3", "16-4-0": "16-4", "16-5-0": "16-5"}, "language": {"10-0-0": "en", "10-0-1": "en", "10-0-2": "en", "10-0-3": "en", "10-0-4": "en", "10-0-5": "en", "10-1-0": "en", "10-1-1": "en", "10-1-2": "en", "10-1-3": "en", "10-1-4": "en", "10-1-5": "en", "10-1-6": "en", "10-1-7": "en", "10-2-0": "en", "10-3-0": "en", "10-3-1": "en", "10-3-2": "en", "10-4-0": "en", "10-4-1": "en", "10-5-0": "en", "10-5-1": "en", "10-5-2": "en", "10-6-0": "en", "10-6-1": "en", "10-7-0": "en", "10-7-1": "en", "10-8-0": "fr", "10-8-1": "fr", "10-8-2": "fr", "10-8-3": "fr", "10-8-4": "fr", "10-9-0": "en", "10-10-0": "en", "10-10-1": "en", "10-11-0": "en", "10-11-1": "en", "10-11-2": "en", "10-11-3": "en", "10-11-4": "en", "10-11-5": "en", "10-12-0": "en", "10-12-1": "en", "10-13-0": "en", "10-14-0": "fr", "10-14-1": "fr", "10-15-0": "en", "10-15-1": "en", "10-15-2": "en", "10-15-3": "en", "10-15-4": "en", "10-15-5": "en", "10-15-6": "en", "10-16-0": "en", "10-16-1": "en", "10-16-2": "en", "10-17-0": "en", "10-18-0": "en", "10-18-1": "en", "10-18-2": "en", "10-18-3": "en", "10-18-4": "en", "10-19-0": "en", "10-19-1": "en", "10-20-0": "en", "10-21-0": "fr", "10-21-1": "fr", "10-21-2": "fr", "10-22-0": "en", "10-23-0": "en", "10-23-1": "en", "10-23-2": "en", "10-23-3": "en", "11-0-0": "en", "11-1-0": "en", "11-1-1": "en", "11-1-2": "en", "11-1-3": "en", "11-2-0": "en", "11-3-0": "en", "11-3-1": "en", "11-4-0": "en", "11-5-0": "en", "11-6-0": "fr", "11-7-0": "en", "11-8-0": "en", "11-8-1": "en", "11-8-2": "en", "11-9-0": "en", "11-9-1": "en", "11-9-2": "en", "11-10-0": "fr", "11-11-0": "en", "11-11-1": "en", "11-11-2": "en", "11-11-3": "en", "11-11-4": "en", "11-11-5": "en", "11-11-6": "en", "11-11-7": "en", "11-12-0": "en", "11-12-1": "en", "11-12-2": "en", "11-13-0": "fr", "11-14-0": "en", "11-14-1": "en", "11-15-0": "en", "11-16-0": "en", "11-16-1": "en", "11-17-0": "en", "11-18-0": "en", "11-19-0": "en", "11-19-1": "en", "11-20-0": "en", "11-21-0": "en", "12-0-0": "en", "12-0-1": "en", "12-1-0": "en", "12-2-0": "en", "12-2-1": "en", "12-3-0": "fr", "12-3-1": "fr", "12-4-0": "fr", "12-4-1": "fr", "12-5-0": "en", "12-6-0": "en", "12-6-1": "en", "12-6-2": "en", "12-7-0": "en", "13-0-0": "en", "13-1-0": "en", "13-2-0": "en", "16-0-0": "en", "16-0-1": "en", "16-0-2": "en", "16-1-0": "en", "16-1-1": "en", "16-1-2": "en", "16-1-3": "en", "16-1-4": "en", "16-1-5": "en", "16-1-6": "en", "16-1-7": "en", "16-1-8": "en", "16-1-9": "en", "16-1-10": "en", "16-1-11": "en", "16-1-12": "en", "16-2-0": "en", "16-3-0": "en", "16-4-0": "en", "16-5-0": "en"}, "sentence": {"10-0-0": "Appreciated receiving test email the day before the event.", "10-0-1": "The test link worked.", "10-0-2": "Unfortunately the actual link for the event did not work.", "10-0-3": "So sadly I have missed the event.", "10-0-4": "Hoping that the presentation portion may be sent out at latter time for viewing when I have a moment.", "10-0-5": "I was really hoping to increase my knowledge of digital and how we as PS are moving forward in this space.", "10-1-0": "How do we become engaged with enabling digital services in the GC?", "10-1-1": "By learning what the GC is doing to become a digital leader is a start.", "10-1-2": "Attending and actively participating at sessions such as these help evolve our thinking by becoming more informed about the emerging needs of tomorrow.", "10-1-3": "Simply thinking of possibilities and understanding limitations is a big step towards understanding the level of effort required in order to modernize GC services.", "10-1-4": "It's not a paradigm shift.", "10-1-5": "The need to reflect services that are modern and efficient has always existed.", "10-1-6": "GC tends to be more static in nature because of the complexity of its organizational structure.", "10-1-7": "Sessions such as these only scratches the surface of what we can do to enhance our knowledge of AI and its potential.", "10-2-0": "No content, basic info, we could have found better speakers.", "10-3-0": "The event that was placed in my lessons in GcCampus did not contain the link for the WebEx.", "10-3-1": "My supervisor and I all the sections of the event and we were unable to find it.", "10-3-2": "Usually it's very straight forward and easy to join.", "10-4-0": "If possible I would like to have access to the Questions that were asked over Webcast/In House with Answers.", "10-4-1": "Can these be sent to all attendees?", "10-5-0": "The webcast delivery was almost unwatchable due to frequently frozen video stream.", "10-5-1": "I was expecting more information about actual procurement but the panel seemed mostly interested in discussing rather basic/introductory concepts about AI.", "10-5-2": "The panels were otherwise very well-spoken and knowledgeable and I would have enjoyed listening regardless of how on topic they were with respect to procurement.", "10-6-0": "I think this is still at the concept stage so wording it as \"what you need to know to use and procure AI\" is deceptive in that there is not enough evidence (other than a pilot) that the practices are sound and the most effective.", "10-6-1": "The folks in the audience did not get a chance to ask questions since the questions that came in through email were given priority.", "10-7-0": "Yes, it was effective.", "10-7-1": "I particularly liked Noel (one of the panelist) for providing simple and clear points delivered throughout his presentation: the general need of AI within the government and the growth of AI implications in the legal affairs as time will go by.", "10-8-0": "Nous aurions aimé avoir du matériel pour chaque participant et pouvoir le rapporter au bureau pour le partager avec les collègues.", "10-8-1": "Il y avait de très bonnes questions sur Slido.", "10-8-2": "J'aurais aimé qu'on prenne plus de temps pour y répondre.", "10-8-3": "Vous demandez si l'événement a rencontré les objectifs d'apprentissage.", "10-8-4": "Il faudrait nous les rappeler pour pouvoir répondre à cette question.", "10-9-0": "Audio level on webcast was low and difficult to hear.", "10-10-0": "The networking opportunities were excellent as well.", "10-10-1": "I met some great CSPS people with whom I'll be following up, and public servants from other departments who are going through similar challenges.", "10-11-0": "The webcast was terrible.", "10-11-1": "Frequent freezing, hearing multiple and different voices.", "10-11-2": "No technical support.", "10-11-3": "I suggest sending the video of the event to those who attend the webcast.", "10-11-4": "Very interesting topic.", "10-11-5": "Need more sessions on the subject.", "10-12-0": "Panel individuals spoke well and gave clear information - including answering the questions.", "10-12-1": "Very well done by both moderator and panel.", "10-13-0": "The panel was very high-level and anyone who is already somewhat familiar with AI issues wouldn't have learned a lot.", "10-14-0": "Certains documents ont été mentionnés, présentés ou distribués au gens sur place mais ceux comme moi en webdiffusion n'avions pas accès à ces documents.", "10-14-1": "Il a été mentionné que ces documents seront accessibles éventuellement mais ils auraient dû l'être durant la webdiffusion.", "10-15-0": "After I registered for the event I received an email asking me to test my connection to confirm that when the event occurred I would be able to see everything.", "10-15-1": "I tested and confirmed.", "10-15-2": "That same email said I would receive a link to the WebEx event 24 hours before it was supposed to occur.", "10-15-3": "I never received this email and when I attempted to access the event through other means there were no avenues available to connect me.", "10-15-4": "A co-worker was attempting to register for the event and had issues.", "10-15-5": "He sent numerous emails for support and he received no response from anyone.", "10-15-6": "Very unfortunate.", "10-16-0": "I felt the session lacked a clear focus with tangible examples.", "10-16-1": "It was difficult to see how AI will fit with my area of work.", "10-16-2": "I found contextualizing the information to be difficult.", "10-17-0": "More sessions around this topic and other emerging technologies would be very helpful.", "10-18-0": "The panel seemed to know little about what AI was and what it could do.", "10-18-1": "They spoke in generalities about the ethics of AI and algorithmic impact assessments, but my impression was that they really didn't understand what that meant.", "10-18-2": "At the end, I was certainly none the wiser.", "10-18-3": "And, I experienced technical issues.", "10-18-4": "The video froze often but I was never able to connect with audio only.", "10-19-0": "This information should be more widely distributed.", "10-19-1": "I am now actively trying to think of uses for AI in my area.", "10-20-0": "Having a person who can speak to actual experience going through this process was perfect.", "10-21-0": "Le titre n'était pas assez spécifique.", "10-21-1": "Ce n'était pas une présentaiton sur l'utilisation de l'IA dans la fonction publique en générale, mais bien sur l'utilisation de l'IA pour créer un outil de procurement.", "10-21-2": "J'aurais préféré une présentation plus générale ou un titre plus spécifique.", "10-22-0": "Did not participate (webinar)", "10-23-0": "I was only able to stay for the Panel discussion.", "10-23-1": "While there was some relevant information discussed, it would have been extremely helpful to have had documents available in paper/on screen while discussing.", "10-23-2": "Many documents were alluded to but were not available, and no follow up email has yet been issued.", "10-23-3": "The panelists clearly possessed a significant amount of information, but I felt that they did not go into sufficient detail on their experiences.", "11-0-0": "N/A  as I only signed up for the webinar", "11-1-0": "I think the concept of identifying business requirements was really interesting but unfortunately I was not able to fully focus my attention because of differing views and needs of all participants.", "11-1-1": "I attempted to focus attention on identifying one need for the purposes of completing the exercise but I wasn't very successful.", "11-1-2": "I'm an introvert and without a moderator that can channel collective input, I'm not the best fitted.", "11-1-3": "I will try to reach out to PSPC and see if I can conduct a mock exercise that is more focused because I believe there exists a mutual learning opportunity and that my input might help inform aspects of the procurement vehicle.", "11-2-0": "No idea I couldn't join", "11-3-0": "I would love to see the results from this workshop.", "11-3-1": "I had to leave a few minutes early so didn't catch the wrap up!", "11-4-0": "I did not watch this through webcast.", "11-5-0": "We didn't have time to hear what other groups wrote.", "11-6-0": "C'était professionnel d'avoir 4-5 personnes qui faisaient le tour des tables.", "11-7-0": "It would have been nice to make provisions for those attending via webcast.", "11-8-0": "See my comments from the previous question.", "11-8-1": "It was effective to work with a colleague's real-life challenge and go through the process of scoping it.", "11-8-2": "It was a good combination with the panel discussion.", "11-9-0": "I did not participate in the workshop.", "11-9-1": "If there are materials from this workshop, I would like to have a copy.", "11-9-2": "Please and thank you!", "11-10-0": "Je n'ai malheureusement pas participé à l'atelier", "11-11-0": "I like the structure of questionnaire (it seems to be easier to start from 13 then up to 1 statement of work).", "11-11-1": "However, I am still a little confused.", "11-11-2": "Who should fill the questionnaire?", "11-11-3": "client-end user? contracting officers?", "11-11-4": "both?", "11-11-5": "This is a tool.", "11-11-6": "To use the tool effectively, there should be a work organization to come with and a support structure (with real people) to help user of system to troubleshoot.", "11-11-7": "Thanks.", "11-12-0": "The most relevant part was the presentation at the beginning of the workshop where the new procurement process was presented.", "11-12-1": "The workshop itself wasn't super useful.", "11-12-2": "We had to get into specifics on a topic that people around the table didn't know very well.", "11-13-0": "Accès en webdiffusion donc exclus de la partie atelier pratique.", "11-14-0": "I attended via WebEx.", "11-14-1": "I did not attend the practical workshop.", "11-15-0": "I did not attend this part.", "11-16-0": "Webcast participants could not participate in the in person activity re: building requirements.", "11-16-1": "Hopefully further information to templates, guides etc.. will be sent out to webcast viewers on using the source list.", "11-17-0": "Did not attend.", "11-18-0": "Workshop was not part of the webcast", "11-19-0": "I found this workshop ok to interact with the people at my table.", "11-19-1": "I would have liked to get feedback on our answers to know if we were on the right path or not.", "11-20-0": "Did not participate in this portion of the event", "11-21-0": "Unable to attend the workshop", "12-0-0": "Real link did not work.", "12-0-1": "See my earlier comments.", "12-1-0": "The combination of panel discussion and practical application was excellent.", "12-2-0": "You didn't give more time for panelists to answer online questions.", "12-2-1": "May sahre with us if those were dealt with.", "12-3-0": "Je trouve que lorsque nous avons une présentation traduite, cela change beaucoup la dynamique.", "12-3-1": "Ils font un très bon travail, mais le \"ton\" ne reflète pas l'interlocuteur alors cela rend la présentation plus monotone.", "12-4-0": "La webdiffusion à mon site (Centre de recherche de Valcartier QC) coupait sans arrêt ce qui rendait impossible de suivre l'événement.", "12-4-1": "J'ai dû utiliser la téléconférence (audio seulement via ligne téléphonique).", "12-5-0": "In my case it would be a huge learning curve for the implementation of any AI.", "12-6-0": "I don't know what I don't know.", "12-6-1": "It seems like the process can be quick, but unfortunately experience dictates otherwise.", "12-6-2": "I am nonetheless optimistic and look forward to going through it.", "12-7-0": "We need more events on this subject and maybe more detailed and technical for non-specialist employees", "13-0-0": "Senior Management", "13-1-0": "Agency newsletter", "13-2-0": "Colleague", "16-0-0": "As an EX it is helpful to understand the possibilities and risks of new technologies and applications/innovations in other industries.", "16-0-1": "It help vision the possibilities in business model shifts, culture shifts and digital service transformations we need to make in PS.", "16-0-2": "Appreciate kindly more events in this area.", "16-1-0": "Change Management: I'd like to listen to a discussion on how the GC is building capacity (communities of practice, focus groups, working groups, learning opportunities, etc.).", "16-1-1": "I'd like to understand the level of commitment from senior management in terms of engaging employees in digital enablement in the GC.", "16-1-2": "For example, examining challenges and successes of talent development, training, leadership.", "16-1-3": "Why aren't digital principles tied to our PMAs?", "16-1-4": "Are there opportunities to encourage more flexible roles and responsibilities with respect to position criteria.", "16-1-5": "Can we reform and modernize our current workforce structure?", "16-1-6": "Are there policy barriers that prevent us from asking more commitment from our employees such as being digital (as a mindset) and thinking of modernization as a continuous cycle of evolution?", "16-1-7": "Why aren't hiring practices more evolved?", "16-1-8": "It would be extremely interesting to understand the investment needed to build our digital capacity along with challenges (perceived or real) such as impacts from union negotiations, collective agreements and our approach to hiring.", "16-1-9": "I find having to constantly explain the benefits in making our data more accessible exhausting.", "16-1-10": "Having to answer questions such as why modernizing our services is important and why enhancing our data state is meaningful.", "16-1-11": "These suggestions are broad but I truly believe that examining the state of our workforce and thinking of how to build capacity (to fit the need of today and tomorrow) is important if we are going to be successful at becoming digitally relevant.", "16-1-12": "The more we automate processes, the more important it is at examining its impact and consequences which require a human analysis.", "16-2-0": "Suppliers of AI can present how they can help with Government projects.", "16-3-0": "I look forward to a new batch of similar presentations with the Digital Academy.", "16-4-0": "Emerging (IT) trends that can help develop/strengthen (future) careers within the public sector.", "16-5-0": "- How to use AI for financial Agents\n- What skills to be learned to stay tuned with these new technologies"}, "sentiment_score": {"10-0-0": 0.8999999761581421, "10-0-1": 0.0, "10-0-2": -0.699999988079071, "10-0-3": 0.0, "10-0-4": 0.0, "10-0-5": 0.30000001192092896, "10-1-0": 0.0, "10-1-1": 0.800000011920929, "10-1-2": 0.4000000059604645, "10-1-3": 0.6000000238418579, "10-1-4": 0.0, "10-1-5": 0.800000011920929, "10-1-6": 0.10000000149011612, "10-1-7": 0.5, "10-2-0": -0.8999999761581421, "10-3-0": -0.20000000298023224, "10-3-1": -0.5, "10-3-2": 0.8999999761581421, "10-4-0": -0.4000000059604645, "10-4-1": -0.10000000149011612, "10-5-0": -0.8999999761581421, "10-5-1": -0.5, "10-5-2": 0.800000011920929, "10-6-0": -0.20000000298023224, "10-6-1": -0.30000001192092896, "10-7-0": 0.800000011920929, "10-7-1": 0.699999988079071, "10-8-0": 0.4000000059604645, "10-8-1": 0.6000000238418579, "10-8-2": 0.20000000298023224, "10-8-3": 0.699999988079071, "10-8-4": -0.10000000149011612, "10-9-0": -0.5, "10-10-0": 0.8999999761581421, "10-10-1": 0.800000011920929, "10-11-0": -0.8999999761581421, "10-11-1": -0.8999999761581421, "10-11-2": -0.30000001192092896, "10-11-3": 0.4000000059604645, "10-11-4": 0.5, "10-11-5": 0.10000000149011612, "10-12-0": 0.10000000149011612, "10-12-1": 0.6000000238418579, "10-13-0": 0.0, "10-14-0": 0.0, "10-14-1": -0.5, "10-15-0": -0.6000000238418579, "10-15-1": 0.0, "10-15-2": -0.30000001192092896, "10-15-3": -0.800000011920929, "10-15-4": -0.5, "10-15-5": -0.800000011920929, "10-15-6": -0.6000000238418579, "10-16-0": -0.4000000059604645, "10-16-1": -0.699999988079071, "10-16-2": 0.10000000149011612, "10-17-0": 0.699999988079071, "10-18-0": 0.0, "10-18-1": -0.800000011920929, "10-18-2": 0.0, "10-18-3": -0.20000000298023224, "10-18-4": -0.800000011920929, "10-19-0": 0.20000000298023224, "10-19-1": -0.10000000149011612, "10-20-0": 0.800000011920929, "10-21-0": -0.699999988079071, "10-21-1": 0.0, "10-21-2": 0.20000000298023224, "10-22-0": -0.10000000149011612, "10-23-0": -0.30000001192092896, "10-23-1": 0.800000011920929, "10-23-2": -0.5, "10-23-3": -0.699999988079071, "11-0-0": 0.0, "11-1-0": -0.800000011920929, "11-1-1": -0.5, "11-1-2": 0.0, "11-1-3": 0.4000000059604645, "11-2-0": -0.6000000238418579, "11-3-0": 0.699999988079071, "11-3-1": -0.30000001192092896, "11-4-0": -0.10000000149011612, "11-5-0": -0.20000000298023224, "11-6-0": 0.0, "11-7-0": 0.20000000298023224, "11-8-0": 0.0, "11-8-1": 0.800000011920929, "11-8-2": 0.699999988079071, "11-9-0": -0.20000000298023224, "11-9-1": 0.10000000149011612, "11-9-2": 0.0, "11-10-0": -0.5, "11-11-0": 0.30000001192092896, "11-11-1": 0.5, "11-11-2": -0.20000000298023224, "11-11-3": 0.0, "11-11-4": 0.0, "11-11-5": 0.10000000149011612, "11-11-6": 0.30000001192092896, "11-11-7": 0.10000000149011612, "11-12-0": 0.6000000238418579, "11-12-1": -0.6000000238418579, "11-12-2": 0.0, "11-13-0": 0.10000000149011612, "11-14-0": 0.0, "11-14-1": -0.5, "11-15-0": 0.0, "11-16-0": -0.10000000149011612, "11-16-1": 0.20000000298023224, "11-17-0": -0.20000000298023224, "11-18-0": 0.0, "11-19-0": 0.4000000059604645, "11-19-1": -0.10000000149011612, "11-20-0": -0.30000001192092896, "11-21-0": -0.699999988079071, "12-0-0": -0.699999988079071, "12-0-1": 0.0, "12-1-0": 0.8999999761581421, "12-2-0": -0.30000001192092896, "12-2-1": 0.10000000149011612, "12-3-0": 0.800000011920929, "12-3-1": -0.6000000238418579, "12-4-0": -0.5, "12-4-1": -0.20000000298023224, "12-5-0": 0.800000011920929, "12-6-0": -0.4000000059604645, "12-6-1": -0.20000000298023224, "12-6-2": 0.5, "12-7-0": 0.699999988079071, "13-0-0": 0.0, "13-1-0": 0.0, "13-2-0": 0.0, "16-0-0": 0.8999999761581421, "16-0-1": 0.6000000238418579, "16-0-2": 0.8999999761581421, "16-1-0": 0.5, "16-1-1": 0.4000000059604645, "16-1-2": 0.6000000238418579, "16-1-3": -0.10000000149011612, "16-1-4": 0.699999988079071, "16-1-5": 0.0, "16-1-6": -0.30000001192092896, "16-1-7": 0.0, "16-1-8": 0.6000000238418579, "16-1-9": -0.30000001192092896, "16-1-10": 0.5, "16-1-11": 0.5, "16-1-12": 0.4000000059604645, "16-2-0": 0.30000001192092896, "16-3-0": 0.0, "16-4-0": 0.10000000149011612, "16-5-0": 0.20000000298023224}, "magnitude_score": {"10-0-0": 0.8999999761581421, "10-0-1": 0.0, "10-0-2": 0.699999988079071, "10-0-3": 0.0, "10-0-4": 0.0, "10-0-5": 0.30000001192092896, "10-1-0": 0.0, "10-1-1": 0.800000011920929, "10-1-2": 0.4000000059604645, "10-1-3": 0.6000000238418579, "10-1-4": 0.0, "10-1-5": 0.800000011920929, "10-1-6": 0.10000000149011612, "10-1-7": 0.5, "10-2-0": 0.8999999761581421, "10-3-0": 0.20000000298023224, "10-3-1": 0.5, "10-3-2": 0.8999999761581421, "10-4-0": 0.4000000059604645, "10-4-1": 0.10000000149011612, "10-5-0": 0.8999999761581421, "10-5-1": 0.5, "10-5-2": 0.800000011920929, "10-6-0": 0.20000000298023224, "10-6-1": 0.30000001192092896, "10-7-0": 0.800000011920929, "10-7-1": 0.699999988079071, "10-8-0": 0.4000000059604645, "10-8-1": 0.6000000238418579, "10-8-2": 0.20000000298023224, "10-8-3": 0.699999988079071, "10-8-4": 0.10000000149011612, "10-9-0": 0.5, "10-10-0": 0.8999999761581421, "10-10-1": 0.800000011920929, "10-11-0": 0.8999999761581421, "10-11-1": 0.8999999761581421, "10-11-2": 0.30000001192092896, "10-11-3": 0.4000000059604645, "10-11-4": 0.5, "10-11-5": 0.10000000149011612, "10-12-0": 0.10000000149011612, "10-12-1": 0.6000000238418579, "10-13-0": 0.0, "10-14-0": 0.0, "10-14-1": 0.5, "10-15-0": 0.6000000238418579, "10-15-1": 0.0, "10-15-2": 0.30000001192092896, "10-15-3": 0.800000011920929, "10-15-4": 0.5, "10-15-5": 0.800000011920929, "10-15-6": 0.6000000238418579, "10-16-0": 0.4000000059604645, "10-16-1": 0.699999988079071, "10-16-2": 0.10000000149011612, "10-17-0": 0.699999988079071, "10-18-0": 0.0, "10-18-1": 0.800000011920929, "10-18-2": 0.0, "10-18-3": 0.20000000298023224, "10-18-4": 0.800000011920929, "10-19-0": 0.20000000298023224, "10-19-1": 0.10000000149011612, "10-20-0": 0.800000011920929, "10-21-0": 0.699999988079071, "10-21-1": 0.0, "10-21-2": 0.20000000298023224, "10-22-0": 0.10000000149011612, "10-23-0": 0.30000001192092896, "10-23-1": 0.800000011920929, "10-23-2": 0.5, "10-23-3": 0.699999988079071, "11-0-0": 0.0, "11-1-0": 0.800000011920929, "11-1-1": 0.5, "11-1-2": 0.0, "11-1-3": 0.4000000059604645, "11-2-0": 0.6000000238418579, "11-3-0": 0.699999988079071, "11-3-1": 0.30000001192092896, "11-4-0": 0.10000000149011612, "11-5-0": 0.20000000298023224, "11-6-0": 0.0, "11-7-0": 0.20000000298023224, "11-8-0": 0.0, "11-8-1": 0.800000011920929, "11-8-2": 0.699999988079071, "11-9-0": 0.20000000298023224, "11-9-1": 0.10000000149011612, "11-9-2": 0.0, "11-10-0": 0.5, "11-11-0": 0.30000001192092896, "11-11-1": 0.5, "11-11-2": 0.20000000298023224, "11-11-3": 0.0, "11-11-4": 0.0, "11-11-5": 0.10000000149011612, "11-11-6": 0.30000001192092896, "11-11-7": 0.10000000149011612, "11-12-0": 0.6000000238418579, "11-12-1": 0.6000000238418579, "11-12-2": 0.0, "11-13-0": 0.10000000149011612, "11-14-0": 0.0, "11-14-1": 0.5, "11-15-0": 0.0, "11-16-0": 0.10000000149011612, "11-16-1": 0.20000000298023224, "11-17-0": 0.20000000298023224, "11-18-0": 0.0, "11-19-0": 0.4000000059604645, "11-19-1": 0.10000000149011612, "11-20-0": 0.30000001192092896, "11-21-0": 0.699999988079071, "12-0-0": 0.699999988079071, "12-0-1": 0.0, "12-1-0": 0.8999999761581421, "12-2-0": 0.30000001192092896, "12-2-1": 0.10000000149011612, "12-3-0": 0.800000011920929, "12-3-1": 0.6000000238418579, "12-4-0": 0.5, "12-4-1": 0.20000000298023224, "12-5-0": 0.800000011920929, "12-6-0": 0.4000000059604645, "12-6-1": 0.20000000298023224, "12-6-2": 0.5, "12-7-0": 0.699999988079071, "13-0-0": 0.0, "13-1-0": 0.0, "13-2-0": 0.0, "16-0-0": 0.8999999761581421, "16-0-1": 0.6000000238418579, "16-0-2": 0.8999999761581421, "16-1-0": 0.5, "16-1-1": 0.4000000059604645, "16-1-2": 0.6000000238418579, "16-1-3": 0.10000000149011612, "16-1-4": 0.699999988079071, "16-1-5": 0.0, "16-1-6": 0.30000001192092896, "16-1-7": 0.0, "16-1-8": 0.6000000238418579, "16-1-9": 0.30000001192092896, "16-1-10": 0.5, "16-1-11": 0.5, "16-1-12": 0.4000000059604645, "16-2-0": 0.30000001192092896, "16-3-0": 0.0, "16-4-0": 0.10000000149011612, "16-5-0": 0.20000000298023224}, "number_of_words": {"10-0-0": 9, "10-0-1": 4, "10-0-2": 10, "10-0-3": 7, "10-0-4": 19, "10-0-5": 21, "10-1-0": 12, "10-1-1": 15, "10-1-2": 23, "10-1-3": 24, "10-1-4": 6, "10-1-5": 13, "10-1-6": 16, "10-1-7": 22, "10-2-0": 10, "10-3-0": 18, "10-3-1": 17, "10-3-2": 10, "10-4-0": 19, "10-4-1": 7, "10-5-0": 12, "10-5-1": 21, "10-5-2": 25, "10-6-0": 49, "10-6-1": 24, "10-7-0": 4, "10-7-1": 43, "10-8-0": 21, "10-8-1": 9, "10-8-2": 10, "10-8-3": 9, "10-8-4": 11, "10-9-0": 10, "10-10-0": 7, "10-10-1": 25, "10-11-0": 4, "10-11-1": 7, "10-11-2": 3, "10-11-3": 14, "10-11-4": 3, "10-11-5": 6, "10-12-0": 13, "10-12-1": 8, "10-13-0": 21, "10-14-0": 24, "10-14-1": 18, "10-15-0": 30, "10-15-1": 4, "10-15-2": 21, "10-15-3": 24, "10-15-4": 12, "10-15-5": 13, "10-15-6": 2, "10-16-0": 11, "10-16-1": 14, "10-16-2": 8, "10-17-0": 13, "10-18-0": 15, "10-18-1": 26, "10-18-2": 9, "10-18-3": 5, "10-18-4": 14, "10-19-0": 7, "10-19-1": 14, "10-20-0": 15, "10-21-0": 6, "10-21-1": 27, "10-21-2": 11, "10-22-0": 6, "10-23-0": 10, "10-23-1": 23, "10-23-2": 18, "10-23-3": 23, "11-0-0": 9, "11-1-0": 31, "11-1-1": 22, "11-1-2": 19, "11-1-3": 42, "11-2-0": 6, "11-3-0": 10, "11-3-1": 15, "11-4-0": 7, "11-5-0": 11, "11-6-0": 11, "11-7-0": 13, "11-8-0": 7, "11-8-1": 19, "11-8-2": 9, "11-9-0": 7, "11-9-1": 14, "11-9-2": 4, "11-10-0": 7, "11-11-0": 24, "11-11-1": 7, "11-11-2": 5, "11-11-3": 4, "11-11-4": 1, "11-11-5": 4, "11-11-6": 30, "11-11-7": 1, "11-12-0": 20, "11-12-1": 7, "11-12-2": 19, "11-13-0": 10, "11-14-0": 4, "11-14-1": 7, "11-15-0": 6, "11-16-0": 13, "11-16-1": 19, "11-17-0": 3, "11-18-0": 7, "11-19-0": 13, "11-19-1": 21, "11-20-0": 9, "11-21-0": 5, "12-0-0": 5, "12-0-1": 4, "12-1-0": 10, "12-2-0": 12, "12-2-1": 9, "12-3-0": 14, "12-3-1": 22, "12-4-0": 23, "12-4-1": 12, "12-5-0": 16, "12-6-0": 9, "12-6-1": 13, "12-6-2": 11, "12-7-0": 16, "13-0-0": 2, "13-1-0": 2, "13-2-0": 1, "16-0-0": 20, "16-0-1": 21, "16-0-2": 7, "16-1-0": 29, "16-1-1": 23, "16-1-2": 11, "16-1-3": 9, "16-1-4": 15, "16-1-5": 9, "16-1-6": 33, "16-1-7": 7, "16-1-8": 36, "16-1-9": 15, "16-1-10": 20, "16-1-11": 45, "16-1-12": 21, "16-2-0": 12, "16-3-0": 14, "16-4-0": 17, "16-5-0": 21}}, "questions": {"1": {"index": "1", "title": "1. Overall, I was satisfied with this learning event.\n ", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 11, "1": 20, "2": 9, "3": 4, "4": 1}, "%": {"0": 24.44, "1": 44.44, "2": 20.0, "3": 8.89, "4": 2.22}}, "has_comments": false}, "2": {"index": "2", "title": "2. I was satisfied with the content of this learning event (e.g. accuracy, currency, relevance).\n ", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 11, "1": 23, "2": 5, "3": 5, "4": 1}, "%": {"0": 24.44, "1": 51.11, "2": 11.11, "3": 11.11, "4": 2.22}}, "has_comments": false}, "3": {"index": "3", "title": "3. I was satisfied with the materials (e.g. manual, presentation, hand-outs) used in this learning event.", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree", "5": NaN}, "Total": {"0": 5, "1": 11, "2": 13, "3": 3, "4": 3, "5": 11}, "%": {"0": 10.87, "1": 23.91, "2": 28.26, "3": 6.52, "4": 6.52, "5": 23.91}}, "has_comments": false}, "4": {"index": "4", "title": "4. The learning event was well structured (e.g. length, pace, flow of information).", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 10, "1": 25, "2": 10, "3": 0, "4": 1}, "%": {"0": 21.74, "1": 54.35, "2": 21.74, "3": 0.0, "4": 2.17}}, "has_comments": false}, "5": {"index": "5", "title": "5. This learning event was a worthwhile investment for my employer.", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 14, "1": 17, "2": 9, "3": 4, "4": 1}, "%": {"0": 31.11, "1": 37.78, "2": 20.0, "3": 8.89, "4": 2.22}}, "has_comments": false}, "6": {"index": "6", "title": "6. The learning objectives were met.", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 7, "1": 20, "2": 14, "3": 4, "4": 1}, "%": {"0": 15.22, "1": 43.48, "2": 30.43, "3": 8.7, "4": 2.17}}, "has_comments": false}, "7": {"index": "7", "title": "7. Did you attend this learning event  through Webcast?", "response_data": {"Choice": {"0": "Yes", "1": "No"}, "Total": {"0": 28, "1": 18}, "%": {"0": 60.87, "1": 39.13}}, "has_comments": false}, "8": {"index": "8", "title": "7a. The Webcast was an appropriate delivery method for this content.", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 7, "1": 15, "2": 4, "3": 1, "4": 0}, "%": {"0": 25.93, "1": 55.56, "2": 14.81, "3": 3.7, "4": 0.0}}, "has_comments": false}, "9": {"index": "9", "title": "7b. The level of technical support provided for this learning event was appropriate.", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 5, "1": 9, "2": 9, "3": 3, "4": 2}, "%": {"0": 17.86, "1": 32.14, "2": 32.14, "3": 10.71, "4": 7.14}}, "has_comments": false}, "10": {"index": "10", "title": "8a1. This session was effective.\n ", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 10, "1": 21, "2": 9, "3": 3, "4": 2}, "%": {"0": 22.22, "1": 46.67, "2": 20.0, "3": 6.67, "4": 4.44}}, "has_comments": true, "comments": {"language": {"10-0": "en", "10-1": "en", "10-2": "en", "10-3": "en", "10-4": "en", "10-5": "en", "10-6": "en", "10-7": "en", "10-8": "fr", "10-9": "en", "10-10": "en", "10-11": "en", "10-12": "en", "10-13": "en", "10-14": "fr", "10-15": "en", "10-16": "en", "10-17": "en", "10-18": "en", "10-19": "en", "10-20": "en", "10-21": "fr", "10-22": "en", "10-23": "en"}, "comment": {"10-0": "Appreciated receiving test email the day before the event.  The test link worked.  Unfortunately the actual link for the event did not work.  So sadly I have missed the event.  Hoping that the presentation portion may be sent out at latter time for viewing when I have a moment.  I was really hoping to increase my knowledge of digital and how we as PS are moving forward in this space.", "10-1": "How do we become engaged with enabling digital services in the GC? By learning what the GC is doing to become a digital leader is a start. Attending and actively participating at sessions such as these help evolve our thinking by becoming more informed about the emerging needs of tomorrow. Simply thinking of possibilities and understanding limitations is a big step towards understanding the level of effort required in order to modernize GC services. It's not a paradigm shift. The need to reflect services that are modern and efficient has always existed. GC tends to be more static in nature because of the complexity of its organizational structure. Sessions such as these only scratches the surface of what we can do to enhance our knowledge of AI and its potential.", "10-2": "No content, basic info, we could have found better speakers.", "10-3": "The event that was placed in my lessons in GcCampus did not contain the link for the WebEx. My supervisor and I all the sections of the event and we were unable to find it. Usually it's very straight forward and easy to join.", "10-4": "If possible I would like to have access to the Questions that were asked over Webcast/In House with Answers. Can these be sent to all attendees?", "10-5": "The webcast delivery was almost unwatchable due to frequently frozen video stream. I was expecting more information about actual procurement but the panel seemed mostly interested in discussing rather basic/introductory concepts about AI. The panels were otherwise very well-spoken and knowledgeable and I would have enjoyed listening regardless of how on topic they were with respect to procurement.", "10-6": "I think this is still at the concept stage so wording it as \"what you need to know to use and procure AI\" is deceptive in that there is not enough evidence (other than a pilot) that the practices are sound and the most effective.   The folks in the audience did not get a chance to ask questions since the questions that came in through email were given priority.", "10-7": "Yes, it was effective. I particularly liked Noel (one of the panelist) for providing simple and clear points delivered throughout his presentation: the general need of AI within the government and the growth of AI implications in the legal affairs as time will go by.", "10-8": "Nous aurions aimé avoir du matériel pour chaque participant et pouvoir le rapporter au bureau pour le partager avec les collègues.\nIl y avait de très bonnes questions sur Slido. J'aurais aimé qu'on prenne plus de temps pour y répondre.\nVous demandez si l'événement a rencontré les objectifs d'apprentissage. Il faudrait nous les rappeler pour pouvoir répondre à cette question.", "10-9": "Audio level on webcast was low and difficult to hear.", "10-10": "The networking opportunities were excellent as well.  I met some great CSPS people with whom I'll be following up, and public servants from other departments who are going through similar challenges.", "10-11": "The webcast was terrible. Frequent freezing, hearing multiple and different voices. No technical support. I suggest sending the video of the event to those who attend the webcast. Very interesting topic. Need more sessions on the subject.", "10-12": "Panel individuals spoke well and gave clear information - including answering the questions. Very well done by both moderator and panel.", "10-13": "The panel was very high-level and anyone who is already somewhat familiar with AI issues wouldn't have learned a lot.", "10-14": "Certains documents ont été mentionnés, présentés ou distribués au gens sur place mais ceux comme moi en webdiffusion n'avions pas accès à ces documents. Il a été mentionné que ces documents seront accessibles éventuellement mais ils auraient dû l'être durant la webdiffusion.", "10-15": "After I registered for the event I received an email asking me to test my connection to confirm that when the event occurred I would be able to see everything. I tested and confirmed. That same email said I would receive a link to the WebEx event 24 hours before it was supposed to occur. I never received this email and when I attempted to access the event through other means there were no avenues available to connect me. A co-worker was attempting to register for the event and had issues. He sent numerous emails for support and he received no response from anyone. Very unfortunate.", "10-16": "I felt the session lacked a clear focus with tangible examples. It was difficult to see how AI will fit with my area of work. I found contextualizing the information to be difficult.", "10-17": "More sessions around this topic and other emerging technologies would be very helpful.", "10-18": "The panel seemed to know little about what AI was and what it could do. They spoke in generalities about the ethics of AI and algorithmic impact assessments, but my impression was that they really didn't understand what that meant. At the end, I was certainly none the wiser.\n\nAnd, I experienced technical issues. The video froze often but I was never able to connect with audio only.", "10-19": "This information should be more widely distributed.  I am now actively trying to think of uses for AI in my area.", "10-20": "Having a person who can speak to actual experience going through this process was perfect.", "10-21": "Le titre n'était pas assez spécifique. Ce n'était pas une présentaiton sur l'utilisation de l'IA dans la fonction publique en générale, mais bien sur l'utilisation de l'IA pour créer un outil de procurement. J'aurais préféré une présentation plus générale ou un titre plus spécifique.", "10-22": "Did not participate (webinar)", "10-23": "I was only able to stay for the Panel discussion.  While there was some relevant information discussed, it would have been extremely helpful to have had documents available in paper/on screen while discussing.  Many documents were alluded to but were not available, and no follow up email has yet been issued.  The panelists clearly possessed a significant amount of information, but I felt that they did not go into sufficient detail on their experiences."}, "sentiment_score": {"10-0": 0.0, "10-1": 0.4000000059604645, "10-2": -0.8999999761581421, "10-3": 0.0, "10-4": -0.20000000298023224, "10-5": -0.20000000298023224, "10-6": -0.20000000298023224, "10-7": 0.699999988079071, "10-8": 0.30000001192092896, "10-9": -0.5, "10-10": 0.800000011920929, "10-11": -0.10000000149011612, "10-12": 0.4000000059604645, "10-13": 0.0, "10-14": -0.20000000298023224, "10-15": -0.5, "10-16": -0.30000001192092896, "10-17": 0.699999988079071, "10-18": -0.30000001192092896, "10-19": 0.0, "10-20": 0.800000011920929, "10-21": -0.10000000149011612, "10-22": -0.10000000149011612, "10-23": -0.20000000298023224}, "magnitude_score": {"10-0": 2.0999999046325684, "10-1": 3.5, "10-2": 0.8999999761581421, "10-3": 1.600000023841858, "10-4": 0.5, "10-5": 2.4000000953674316, "10-6": 0.5, "10-7": 1.5, "10-8": 2.299999952316284, "10-9": 0.5, "10-10": 1.7000000476837158, "10-11": 3.0999999046325684, "10-12": 0.800000011920929, "10-13": 0.0, "10-14": 0.5, "10-15": 4.0, "10-16": 1.2000000476837158, "10-17": 0.699999988079071, "10-18": 2.0, "10-19": 0.30000001192092896, "10-20": 0.800000011920929, "10-21": 1.0, "10-22": 0.10000000149011612, "10-23": 2.5}, "number_of_sentences": {"10-0": 6, "10-1": 8, "10-2": 1, "10-3": 3, "10-4": 2, "10-5": 3, "10-6": 2, "10-7": 2, "10-8": 5, "10-9": 1, "10-10": 2, "10-11": 6, "10-12": 2, "10-13": 1, "10-14": 2, "10-15": 7, "10-16": 3, "10-17": 1, "10-18": 5, "10-19": 2, "10-20": 1, "10-21": 3, "10-22": 1, "10-23": 4}, "number_of_words": {"10-0": 70, "10-1": 131, "10-2": 10, "10-3": 45, "10-4": 26, "10-5": 58, "10-6": 73, "10-7": 47, "10-8": 60, "10-9": 10, "10-10": 32, "10-11": 37, "10-12": 21, "10-13": 21, "10-14": 42, "10-15": 106, "10-16": 33, "10-17": 13, "10-18": 69, "10-19": 21, "10-20": 15, "10-21": 44, "10-22": 6, "10-23": 74}}, "sentences": {"comment_id": {"10-0-0": "10-0", "10-0-1": "10-0", "10-0-2": "10-0", "10-0-3": "10-0", "10-0-4": "10-0", "10-0-5": "10-0", "10-1-0": "10-1", "10-1-1": "10-1", "10-1-2": "10-1", "10-1-3": "10-1", "10-1-4": "10-1", "10-1-5": "10-1", "10-1-6": "10-1", "10-1-7": "10-1", "10-2-0": "10-2", "10-3-0": "10-3", "10-3-1": "10-3", "10-3-2": "10-3", "10-4-0": "10-4", "10-4-1": "10-4", "10-5-0": "10-5", "10-5-1": "10-5", "10-5-2": "10-5", "10-6-0": "10-6", "10-6-1": "10-6", "10-7-0": "10-7", "10-7-1": "10-7", "10-8-0": "10-8", "10-8-1": "10-8", "10-8-2": "10-8", "10-8-3": "10-8", "10-8-4": "10-8", "10-9-0": "10-9", "10-10-0": "10-10", "10-10-1": "10-10", "10-11-0": "10-11", "10-11-1": "10-11", "10-11-2": "10-11", "10-11-3": "10-11", "10-11-4": "10-11", "10-11-5": "10-11", "10-12-0": "10-12", "10-12-1": "10-12", "10-13-0": "10-13", "10-14-0": "10-14", "10-14-1": "10-14", "10-15-0": "10-15", "10-15-1": "10-15", "10-15-2": "10-15", "10-15-3": "10-15", "10-15-4": "10-15", "10-15-5": "10-15", "10-15-6": "10-15", "10-16-0": "10-16", "10-16-1": "10-16", "10-16-2": "10-16", "10-17-0": "10-17", "10-18-0": "10-18", "10-18-1": "10-18", "10-18-2": "10-18", "10-18-3": "10-18", "10-18-4": "10-18", "10-19-0": "10-19", "10-19-1": "10-19", "10-20-0": "10-20", "10-21-0": "10-21", "10-21-1": "10-21", "10-21-2": "10-21", "10-22-0": "10-22", "10-23-0": "10-23", "10-23-1": "10-23", "10-23-2": "10-23", "10-23-3": "10-23"}, "language": {"10-0-0": "en", "10-0-1": "en", "10-0-2": "en", "10-0-3": "en", "10-0-4": "en", "10-0-5": "en", "10-1-0": "en", "10-1-1": "en", "10-1-2": "en", "10-1-3": "en", "10-1-4": "en", "10-1-5": "en", "10-1-6": "en", "10-1-7": "en", "10-2-0": "en", "10-3-0": "en", "10-3-1": "en", "10-3-2": "en", "10-4-0": "en", "10-4-1": "en", "10-5-0": "en", "10-5-1": "en", "10-5-2": "en", "10-6-0": "en", "10-6-1": "en", "10-7-0": "en", "10-7-1": "en", "10-8-0": "fr", "10-8-1": "fr", "10-8-2": "fr", "10-8-3": "fr", "10-8-4": "fr", "10-9-0": "en", "10-10-0": "en", "10-10-1": "en", "10-11-0": "en", "10-11-1": "en", "10-11-2": "en", "10-11-3": "en", "10-11-4": "en", "10-11-5": "en", "10-12-0": "en", "10-12-1": "en", "10-13-0": "en", "10-14-0": "fr", "10-14-1": "fr", "10-15-0": "en", "10-15-1": "en", "10-15-2": "en", "10-15-3": "en", "10-15-4": "en", "10-15-5": "en", "10-15-6": "en", "10-16-0": "en", "10-16-1": "en", "10-16-2": "en", "10-17-0": "en", "10-18-0": "en", "10-18-1": "en", "10-18-2": "en", "10-18-3": "en", "10-18-4": "en", "10-19-0": "en", "10-19-1": "en", "10-20-0": "en", "10-21-0": "fr", "10-21-1": "fr", "10-21-2": "fr", "10-22-0": "en", "10-23-0": "en", "10-23-1": "en", "10-23-2": "en", "10-23-3": "en"}, "sentence": {"10-0-0": "Appreciated receiving test email the day before the event.", "10-0-1": "The test link worked.", "10-0-2": "Unfortunately the actual link for the event did not work.", "10-0-3": "So sadly I have missed the event.", "10-0-4": "Hoping that the presentation portion may be sent out at latter time for viewing when I have a moment.", "10-0-5": "I was really hoping to increase my knowledge of digital and how we as PS are moving forward in this space.", "10-1-0": "How do we become engaged with enabling digital services in the GC?", "10-1-1": "By learning what the GC is doing to become a digital leader is a start.", "10-1-2": "Attending and actively participating at sessions such as these help evolve our thinking by becoming more informed about the emerging needs of tomorrow.", "10-1-3": "Simply thinking of possibilities and understanding limitations is a big step towards understanding the level of effort required in order to modernize GC services.", "10-1-4": "It's not a paradigm shift.", "10-1-5": "The need to reflect services that are modern and efficient has always existed.", "10-1-6": "GC tends to be more static in nature because of the complexity of its organizational structure.", "10-1-7": "Sessions such as these only scratches the surface of what we can do to enhance our knowledge of AI and its potential.", "10-2-0": "No content, basic info, we could have found better speakers.", "10-3-0": "The event that was placed in my lessons in GcCampus did not contain the link for the WebEx.", "10-3-1": "My supervisor and I all the sections of the event and we were unable to find it.", "10-3-2": "Usually it's very straight forward and easy to join.", "10-4-0": "If possible I would like to have access to the Questions that were asked over Webcast/In House with Answers.", "10-4-1": "Can these be sent to all attendees?", "10-5-0": "The webcast delivery was almost unwatchable due to frequently frozen video stream.", "10-5-1": "I was expecting more information about actual procurement but the panel seemed mostly interested in discussing rather basic/introductory concepts about AI.", "10-5-2": "The panels were otherwise very well-spoken and knowledgeable and I would have enjoyed listening regardless of how on topic they were with respect to procurement.", "10-6-0": "I think this is still at the concept stage so wording it as \"what you need to know to use and procure AI\" is deceptive in that there is not enough evidence (other than a pilot) that the practices are sound and the most effective.", "10-6-1": "The folks in the audience did not get a chance to ask questions since the questions that came in through email were given priority.", "10-7-0": "Yes, it was effective.", "10-7-1": "I particularly liked Noel (one of the panelist) for providing simple and clear points delivered throughout his presentation: the general need of AI within the government and the growth of AI implications in the legal affairs as time will go by.", "10-8-0": "Nous aurions aimé avoir du matériel pour chaque participant et pouvoir le rapporter au bureau pour le partager avec les collègues.", "10-8-1": "Il y avait de très bonnes questions sur Slido.", "10-8-2": "J'aurais aimé qu'on prenne plus de temps pour y répondre.", "10-8-3": "Vous demandez si l'événement a rencontré les objectifs d'apprentissage.", "10-8-4": "Il faudrait nous les rappeler pour pouvoir répondre à cette question.", "10-9-0": "Audio level on webcast was low and difficult to hear.", "10-10-0": "The networking opportunities were excellent as well.", "10-10-1": "I met some great CSPS people with whom I'll be following up, and public servants from other departments who are going through similar challenges.", "10-11-0": "The webcast was terrible.", "10-11-1": "Frequent freezing, hearing multiple and different voices.", "10-11-2": "No technical support.", "10-11-3": "I suggest sending the video of the event to those who attend the webcast.", "10-11-4": "Very interesting topic.", "10-11-5": "Need more sessions on the subject.", "10-12-0": "Panel individuals spoke well and gave clear information - including answering the questions.", "10-12-1": "Very well done by both moderator and panel.", "10-13-0": "The panel was very high-level and anyone who is already somewhat familiar with AI issues wouldn't have learned a lot.", "10-14-0": "Certains documents ont été mentionnés, présentés ou distribués au gens sur place mais ceux comme moi en webdiffusion n'avions pas accès à ces documents.", "10-14-1": "Il a été mentionné que ces documents seront accessibles éventuellement mais ils auraient dû l'être durant la webdiffusion.", "10-15-0": "After I registered for the event I received an email asking me to test my connection to confirm that when the event occurred I would be able to see everything.", "10-15-1": "I tested and confirmed.", "10-15-2": "That same email said I would receive a link to the WebEx event 24 hours before it was supposed to occur.", "10-15-3": "I never received this email and when I attempted to access the event through other means there were no avenues available to connect me.", "10-15-4": "A co-worker was attempting to register for the event and had issues.", "10-15-5": "He sent numerous emails for support and he received no response from anyone.", "10-15-6": "Very unfortunate.", "10-16-0": "I felt the session lacked a clear focus with tangible examples.", "10-16-1": "It was difficult to see how AI will fit with my area of work.", "10-16-2": "I found contextualizing the information to be difficult.", "10-17-0": "More sessions around this topic and other emerging technologies would be very helpful.", "10-18-0": "The panel seemed to know little about what AI was and what it could do.", "10-18-1": "They spoke in generalities about the ethics of AI and algorithmic impact assessments, but my impression was that they really didn't understand what that meant.", "10-18-2": "At the end, I was certainly none the wiser.", "10-18-3": "And, I experienced technical issues.", "10-18-4": "The video froze often but I was never able to connect with audio only.", "10-19-0": "This information should be more widely distributed.", "10-19-1": "I am now actively trying to think of uses for AI in my area.", "10-20-0": "Having a person who can speak to actual experience going through this process was perfect.", "10-21-0": "Le titre n'était pas assez spécifique.", "10-21-1": "Ce n'était pas une présentaiton sur l'utilisation de l'IA dans la fonction publique en générale, mais bien sur l'utilisation de l'IA pour créer un outil de procurement.", "10-21-2": "J'aurais préféré une présentation plus générale ou un titre plus spécifique.", "10-22-0": "Did not participate (webinar)", "10-23-0": "I was only able to stay for the Panel discussion.", "10-23-1": "While there was some relevant information discussed, it would have been extremely helpful to have had documents available in paper/on screen while discussing.", "10-23-2": "Many documents were alluded to but were not available, and no follow up email has yet been issued.", "10-23-3": "The panelists clearly possessed a significant amount of information, but I felt that they did not go into sufficient detail on their experiences."}, "sentiment_score": {"10-0-0": 0.8999999761581421, "10-0-1": 0.0, "10-0-2": -0.699999988079071, "10-0-3": 0.0, "10-0-4": 0.0, "10-0-5": 0.30000001192092896, "10-1-0": 0.0, "10-1-1": 0.800000011920929, "10-1-2": 0.4000000059604645, "10-1-3": 0.6000000238418579, "10-1-4": 0.0, "10-1-5": 0.800000011920929, "10-1-6": 0.10000000149011612, "10-1-7": 0.5, "10-2-0": -0.8999999761581421, "10-3-0": -0.20000000298023224, "10-3-1": -0.5, "10-3-2": 0.8999999761581421, "10-4-0": -0.4000000059604645, "10-4-1": -0.10000000149011612, "10-5-0": -0.8999999761581421, "10-5-1": -0.5, "10-5-2": 0.800000011920929, "10-6-0": -0.20000000298023224, "10-6-1": -0.30000001192092896, "10-7-0": 0.800000011920929, "10-7-1": 0.699999988079071, "10-8-0": 0.4000000059604645, "10-8-1": 0.6000000238418579, "10-8-2": 0.20000000298023224, "10-8-3": 0.699999988079071, "10-8-4": -0.10000000149011612, "10-9-0": -0.5, "10-10-0": 0.8999999761581421, "10-10-1": 0.800000011920929, "10-11-0": -0.8999999761581421, "10-11-1": -0.8999999761581421, "10-11-2": -0.30000001192092896, "10-11-3": 0.4000000059604645, "10-11-4": 0.5, "10-11-5": 0.10000000149011612, "10-12-0": 0.10000000149011612, "10-12-1": 0.6000000238418579, "10-13-0": 0.0, "10-14-0": 0.0, "10-14-1": -0.5, "10-15-0": -0.6000000238418579, "10-15-1": 0.0, "10-15-2": -0.30000001192092896, "10-15-3": -0.800000011920929, "10-15-4": -0.5, "10-15-5": -0.800000011920929, "10-15-6": -0.6000000238418579, "10-16-0": -0.4000000059604645, "10-16-1": -0.699999988079071, "10-16-2": 0.10000000149011612, "10-17-0": 0.699999988079071, "10-18-0": 0.0, "10-18-1": -0.800000011920929, "10-18-2": 0.0, "10-18-3": -0.20000000298023224, "10-18-4": -0.800000011920929, "10-19-0": 0.20000000298023224, "10-19-1": -0.10000000149011612, "10-20-0": 0.800000011920929, "10-21-0": -0.699999988079071, "10-21-1": 0.0, "10-21-2": 0.20000000298023224, "10-22-0": -0.10000000149011612, "10-23-0": -0.30000001192092896, "10-23-1": 0.800000011920929, "10-23-2": -0.5, "10-23-3": -0.699999988079071}, "magnitude_score": {"10-0-0": 0.8999999761581421, "10-0-1": 0.0, "10-0-2": 0.699999988079071, "10-0-3": 0.0, "10-0-4": 0.0, "10-0-5": 0.30000001192092896, "10-1-0": 0.0, "10-1-1": 0.800000011920929, "10-1-2": 0.4000000059604645, "10-1-3": 0.6000000238418579, "10-1-4": 0.0, "10-1-5": 0.800000011920929, "10-1-6": 0.10000000149011612, "10-1-7": 0.5, "10-2-0": 0.8999999761581421, "10-3-0": 0.20000000298023224, "10-3-1": 0.5, "10-3-2": 0.8999999761581421, "10-4-0": 0.4000000059604645, "10-4-1": 0.10000000149011612, "10-5-0": 0.8999999761581421, "10-5-1": 0.5, "10-5-2": 0.800000011920929, "10-6-0": 0.20000000298023224, "10-6-1": 0.30000001192092896, "10-7-0": 0.800000011920929, "10-7-1": 0.699999988079071, "10-8-0": 0.4000000059604645, "10-8-1": 0.6000000238418579, "10-8-2": 0.20000000298023224, "10-8-3": 0.699999988079071, "10-8-4": 0.10000000149011612, "10-9-0": 0.5, "10-10-0": 0.8999999761581421, "10-10-1": 0.800000011920929, "10-11-0": 0.8999999761581421, "10-11-1": 0.8999999761581421, "10-11-2": 0.30000001192092896, "10-11-3": 0.4000000059604645, "10-11-4": 0.5, "10-11-5": 0.10000000149011612, "10-12-0": 0.10000000149011612, "10-12-1": 0.6000000238418579, "10-13-0": 0.0, "10-14-0": 0.0, "10-14-1": 0.5, "10-15-0": 0.6000000238418579, "10-15-1": 0.0, "10-15-2": 0.30000001192092896, "10-15-3": 0.800000011920929, "10-15-4": 0.5, "10-15-5": 0.800000011920929, "10-15-6": 0.6000000238418579, "10-16-0": 0.4000000059604645, "10-16-1": 0.699999988079071, "10-16-2": 0.10000000149011612, "10-17-0": 0.699999988079071, "10-18-0": 0.0, "10-18-1": 0.800000011920929, "10-18-2": 0.0, "10-18-3": 0.20000000298023224, "10-18-4": 0.800000011920929, "10-19-0": 0.20000000298023224, "10-19-1": 0.10000000149011612, "10-20-0": 0.800000011920929, "10-21-0": 0.699999988079071, "10-21-1": 0.0, "10-21-2": 0.20000000298023224, "10-22-0": 0.10000000149011612, "10-23-0": 0.30000001192092896, "10-23-1": 0.800000011920929, "10-23-2": 0.5, "10-23-3": 0.699999988079071}, "number_of_words": {"10-0-0": 9, "10-0-1": 4, "10-0-2": 10, "10-0-3": 7, "10-0-4": 19, "10-0-5": 21, "10-1-0": 12, "10-1-1": 15, "10-1-2": 23, "10-1-3": 24, "10-1-4": 6, "10-1-5": 13, "10-1-6": 16, "10-1-7": 22, "10-2-0": 10, "10-3-0": 18, "10-3-1": 17, "10-3-2": 10, "10-4-0": 19, "10-4-1": 7, "10-5-0": 12, "10-5-1": 21, "10-5-2": 25, "10-6-0": 49, "10-6-1": 24, "10-7-0": 4, "10-7-1": 43, "10-8-0": 21, "10-8-1": 9, "10-8-2": 10, "10-8-3": 9, "10-8-4": 11, "10-9-0": 10, "10-10-0": 7, "10-10-1": 25, "10-11-0": 4, "10-11-1": 7, "10-11-2": 3, "10-11-3": 14, "10-11-4": 3, "10-11-5": 6, "10-12-0": 13, "10-12-1": 8, "10-13-0": 21, "10-14-0": 24, "10-14-1": 18, "10-15-0": 30, "10-15-1": 4, "10-15-2": 21, "10-15-3": 24, "10-15-4": 12, "10-15-5": 13, "10-15-6": 2, "10-16-0": 11, "10-16-1": 14, "10-16-2": 8, "10-17-0": 13, "10-18-0": 15, "10-18-1": 26, "10-18-2": 9, "10-18-3": 5, "10-18-4": 14, "10-19-0": 7, "10-19-1": 14, "10-20-0": 15, "10-21-0": 6, "10-21-1": 27, "10-21-2": 11, "10-22-0": 6, "10-23-0": 10, "10-23-1": 23, "10-23-2": 18, "10-23-3": 23}}, "sentiment_score": 0.012500000186264515, "magnitude_score": 34.49999997764826, "number_of_comments": 24, "number_of_sentences": 73, "number_of_words": 1064}, "11": {"index": "11", "title": "8b1. This session was effective.\n ", "response_data": {"Choice": {"0": "Strongly Agree", "1": "Agree", "2": "Neither agree nor disagree", "3": "Disagree", "4": "Strongly Disagree"}, "Total": {"0": 5, "1": 8, "2": 24, "3": 2, "4": 2}, "%": {"0": 12.2, "1": 19.51, "2": 58.54, "3": 4.88, "4": 4.88}}, "has_comments": true, "comments": {"language": {"11-0": "en", "11-1": "en", "11-2": "en", "11-3": "en", "11-4": "en", "11-5": "en", "11-6": "fr", "11-7": "en", "11-8": "en", "11-9": "en", "11-10": "fr", "11-11": "en", "11-12": "en", "11-13": "fr", "11-14": "en", "11-15": "en", "11-16": "en", "11-17": "en", "11-18": "en", "11-19": "en", "11-20": "en", "11-21": "en"}, "comment": {"11-0": "N/A  as I only signed up for the webinar", "11-1": "I think the concept of identifying business requirements was really interesting but unfortunately I was not able to fully focus my attention because of differing views and needs of all participants. I attempted to focus attention on identifying one need for the purposes of completing the exercise but I wasn't very successful. I'm an introvert and without a moderator that can channel collective input, I'm not the best fitted. I will try to reach out to PSPC and see if I can conduct a mock exercise that is more focused because I believe there exists a mutual learning opportunity and that my input might help inform aspects of the procurement vehicle.", "11-2": "No idea I couldn't join", "11-3": "I would love to see the results from this workshop. I had to leave a few minutes early so didn't catch the wrap up!", "11-4": "I did not watch this through webcast.", "11-5": "We didn't have time to hear what other groups wrote.", "11-6": "C'était professionnel d'avoir 4-5 personnes qui faisaient le tour des tables.", "11-7": "It would have been nice to make provisions for those attending via webcast.", "11-8": "See my comments from the previous question.  It was effective to work with a colleague's real-life challenge and go through the process of scoping it.  It was a good combination with the panel discussion.", "11-9": "I did not participate in the workshop. \nIf there are materials from this workshop, I would like to have a copy. Please and thank you!", "11-10": "Je n'ai malheureusement pas participé à l'atelier", "11-11": "I like the structure of questionnaire (it seems to be easier to start from 13 then up to 1 statement of work). However, I am still a little confused. Who should fill the questionnaire? client-end user? contracting officers? both? This is a tool. To use the tool effectively, there should be a work organization to come with and a support structure (with real people) to help user of system to troubleshoot. Thanks.", "11-12": "The most relevant part was the presentation at the beginning of the workshop where the new procurement process was presented. The workshop itself wasn't super useful. We had to get into specifics on a topic that people around the table didn't know very well.", "11-13": "Accès en webdiffusion donc exclus de la partie atelier pratique.", "11-14": "I attended via WebEx. I did not attend the practical workshop.", "11-15": "I did not attend this part.", "11-16": "Webcast participants could not participate in the in person activity re: building requirements. Hopefully further information to templates, guides etc.. will be sent out to webcast viewers on using the source list.", "11-17": "Did not attend.", "11-18": "Workshop was not part of the webcast", "11-19": "I found this workshop ok to interact with the people at my table. I would have liked to get feedback on our answers to know if we were on the right path or not.", "11-20": "Did not participate in this portion of the event", "11-21": "Unable to attend the workshop"}, "sentiment_score": {"11-0": 0.0, "11-1": -0.20000000298023224, "11-2": -0.6000000238418579, "11-3": 0.10000000149011612, "11-4": -0.10000000149011612, "11-5": -0.20000000298023224, "11-6": 0.0, "11-7": 0.20000000298023224, "11-8": 0.5, "11-9": 0.0, "11-10": -0.5, "11-11": 0.10000000149011612, "11-12": 0.0, "11-13": 0.10000000149011612, "11-14": -0.20000000298023224, "11-15": 0.0, "11-16": 0.0, "11-17": -0.20000000298023224, "11-18": 0.0, "11-19": 0.10000000149011612, "11-20": -0.30000001192092896, "11-21": -0.699999988079071}, "magnitude_score": {"11-0": 0.0, "11-1": 1.7999999523162842, "11-2": 0.6000000238418579, "11-3": 1.100000023841858, "11-4": 0.10000000149011612, "11-5": 0.20000000298023224, "11-6": 0.0, "11-7": 0.20000000298023224, "11-8": 1.600000023841858, "11-9": 0.4000000059604645, "11-10": 0.5, "11-11": 2.0, "11-12": 1.2999999523162842, "11-13": 0.10000000149011612, "11-14": 0.5, "11-15": 0.0, "11-16": 0.4000000059604645, "11-17": 0.20000000298023224, "11-18": 0.0, "11-19": 0.6000000238418579, "11-20": 0.30000001192092896, "11-21": 0.699999988079071}, "number_of_sentences": {"11-0": 1, "11-1": 4, "11-2": 1, "11-3": 2, "11-4": 1, "11-5": 1, "11-6": 1, "11-7": 1, "11-8": 3, "11-9": 3, "11-10": 1, "11-11": 8, "11-12": 3, "11-13": 1, "11-14": 2, "11-15": 1, "11-16": 2, "11-17": 1, "11-18": 1, "11-19": 2, "11-20": 1, "11-21": 1}, "number_of_words": {"11-0": 9, "11-1": 114, "11-2": 6, "11-3": 25, "11-4": 7, "11-5": 11, "11-6": 11, "11-7": 13, "11-8": 35, "11-9": 25, "11-10": 7, "11-11": 76, "11-12": 46, "11-13": 10, "11-14": 11, "11-15": 6, "11-16": 32, "11-17": 3, "11-18": 7, "11-19": 34, "11-20": 9, "11-21": 5}}, "sentences": {"comment_id": {"11-0-0": "11-0", "11-1-0": "11-1", "11-1-1": "11-1", "11-1-2": "11-1", "11-1-3": "11-1", "11-2-0": "11-2", "11-3-0": "11-3", "11-3-1": "11-3", "11-4-0": "11-4", "11-5-0": "11-5", "11-6-0": "11-6", "11-7-0": "11-7", "11-8-0": "11-8", "11-8-1": "11-8", "11-8-2": "11-8", "11-9-0": "11-9", "11-9-1": "11-9", "11-9-2": "11-9", "11-10-0": "11-10", "11-11-0": "11-11", "11-11-1": "11-11", "11-11-2": "11-11", "11-11-3": "11-11", "11-11-4": "11-11", "11-11-5": "11-11", "11-11-6": "11-11", "11-11-7": "11-11", "11-12-0": "11-12", "11-12-1": "11-12", "11-12-2": "11-12", "11-13-0": "11-13", "11-14-0": "11-14", "11-14-1": "11-14", "11-15-0": "11-15", "11-16-0": "11-16", "11-16-1": "11-16", "11-17-0": "11-17", "11-18-0": "11-18", "11-19-0": "11-19", "11-19-1": "11-19", "11-20-0": "11-20", "11-21-0": "11-21"}, "language": {"11-0-0": "en", "11-1-0": "en", "11-1-1": "en", "11-1-2": "en", "11-1-3": "en", "11-2-0": "en", "11-3-0": "en", "11-3-1": "en", "11-4-0": "en", "11-5-0": "en", "11-6-0": "fr", "11-7-0": "en", "11-8-0": "en", "11-8-1": "en", "11-8-2": "en", "11-9-0": "en", "11-9-1": "en", "11-9-2": "en", "11-10-0": "fr", "11-11-0": "en", "11-11-1": "en", "11-11-2": "en", "11-11-3": "en", "11-11-4": "en", "11-11-5": "en", "11-11-6": "en", "11-11-7": "en", "11-12-0": "en", "11-12-1": "en", "11-12-2": "en", "11-13-0": "fr", "11-14-0": "en", "11-14-1": "en", "11-15-0": "en", "11-16-0": "en", "11-16-1": "en", "11-17-0": "en", "11-18-0": "en", "11-19-0": "en", "11-19-1": "en", "11-20-0": "en", "11-21-0": "en"}, "sentence": {"11-0-0": "N/A  as I only signed up for the webinar", "11-1-0": "I think the concept of identifying business requirements was really interesting but unfortunately I was not able to fully focus my attention because of differing views and needs of all participants.", "11-1-1": "I attempted to focus attention on identifying one need for the purposes of completing the exercise but I wasn't very successful.", "11-1-2": "I'm an introvert and without a moderator that can channel collective input, I'm not the best fitted.", "11-1-3": "I will try to reach out to PSPC and see if I can conduct a mock exercise that is more focused because I believe there exists a mutual learning opportunity and that my input might help inform aspects of the procurement vehicle.", "11-2-0": "No idea I couldn't join", "11-3-0": "I would love to see the results from this workshop.", "11-3-1": "I had to leave a few minutes early so didn't catch the wrap up!", "11-4-0": "I did not watch this through webcast.", "11-5-0": "We didn't have time to hear what other groups wrote.", "11-6-0": "C'était professionnel d'avoir 4-5 personnes qui faisaient le tour des tables.", "11-7-0": "It would have been nice to make provisions for those attending via webcast.", "11-8-0": "See my comments from the previous question.", "11-8-1": "It was effective to work with a colleague's real-life challenge and go through the process of scoping it.", "11-8-2": "It was a good combination with the panel discussion.", "11-9-0": "I did not participate in the workshop.", "11-9-1": "If there are materials from this workshop, I would like to have a copy.", "11-9-2": "Please and thank you!", "11-10-0": "Je n'ai malheureusement pas participé à l'atelier", "11-11-0": "I like the structure of questionnaire (it seems to be easier to start from 13 then up to 1 statement of work).", "11-11-1": "However, I am still a little confused.", "11-11-2": "Who should fill the questionnaire?", "11-11-3": "client-end user? contracting officers?", "11-11-4": "both?", "11-11-5": "This is a tool.", "11-11-6": "To use the tool effectively, there should be a work organization to come with and a support structure (with real people) to help user of system to troubleshoot.", "11-11-7": "Thanks.", "11-12-0": "The most relevant part was the presentation at the beginning of the workshop where the new procurement process was presented.", "11-12-1": "The workshop itself wasn't super useful.", "11-12-2": "We had to get into specifics on a topic that people around the table didn't know very well.", "11-13-0": "Accès en webdiffusion donc exclus de la partie atelier pratique.", "11-14-0": "I attended via WebEx.", "11-14-1": "I did not attend the practical workshop.", "11-15-0": "I did not attend this part.", "11-16-0": "Webcast participants could not participate in the in person activity re: building requirements.", "11-16-1": "Hopefully further information to templates, guides etc.. will be sent out to webcast viewers on using the source list.", "11-17-0": "Did not attend.", "11-18-0": "Workshop was not part of the webcast", "11-19-0": "I found this workshop ok to interact with the people at my table.", "11-19-1": "I would have liked to get feedback on our answers to know if we were on the right path or not.", "11-20-0": "Did not participate in this portion of the event", "11-21-0": "Unable to attend the workshop"}, "sentiment_score": {"11-0-0": 0.0, "11-1-0": -0.800000011920929, "11-1-1": -0.5, "11-1-2": 0.0, "11-1-3": 0.4000000059604645, "11-2-0": -0.6000000238418579, "11-3-0": 0.699999988079071, "11-3-1": -0.30000001192092896, "11-4-0": -0.10000000149011612, "11-5-0": -0.20000000298023224, "11-6-0": 0.0, "11-7-0": 0.20000000298023224, "11-8-0": 0.0, "11-8-1": 0.800000011920929, "11-8-2": 0.699999988079071, "11-9-0": -0.20000000298023224, "11-9-1": 0.10000000149011612, "11-9-2": 0.0, "11-10-0": -0.5, "11-11-0": 0.30000001192092896, "11-11-1": 0.5, "11-11-2": -0.20000000298023224, "11-11-3": 0.0, "11-11-4": 0.0, "11-11-5": 0.10000000149011612, "11-11-6": 0.30000001192092896, "11-11-7": 0.10000000149011612, "11-12-0": 0.6000000238418579, "11-12-1": -0.6000000238418579, "11-12-2": 0.0, "11-13-0": 0.10000000149011612, "11-14-0": 0.0, "11-14-1": -0.5, "11-15-0": 0.0, "11-16-0": -0.10000000149011612, "11-16-1": 0.20000000298023224, "11-17-0": -0.20000000298023224, "11-18-0": 0.0, "11-19-0": 0.4000000059604645, "11-19-1": -0.10000000149011612, "11-20-0": -0.30000001192092896, "11-21-0": -0.699999988079071}, "magnitude_score": {"11-0-0": 0.0, "11-1-0": 0.800000011920929, "11-1-1": 0.5, "11-1-2": 0.0, "11-1-3": 0.4000000059604645, "11-2-0": 0.6000000238418579, "11-3-0": 0.699999988079071, "11-3-1": 0.30000001192092896, "11-4-0": 0.10000000149011612, "11-5-0": 0.20000000298023224, "11-6-0": 0.0, "11-7-0": 0.20000000298023224, "11-8-0": 0.0, "11-8-1": 0.800000011920929, "11-8-2": 0.699999988079071, "11-9-0": 0.20000000298023224, "11-9-1": 0.10000000149011612, "11-9-2": 0.0, "11-10-0": 0.5, "11-11-0": 0.30000001192092896, "11-11-1": 0.5, "11-11-2": 0.20000000298023224, "11-11-3": 0.0, "11-11-4": 0.0, "11-11-5": 0.10000000149011612, "11-11-6": 0.30000001192092896, "11-11-7": 0.10000000149011612, "11-12-0": 0.6000000238418579, "11-12-1": 0.6000000238418579, "11-12-2": 0.0, "11-13-0": 0.10000000149011612, "11-14-0": 0.0, "11-14-1": 0.5, "11-15-0": 0.0, "11-16-0": 0.10000000149011612, "11-16-1": 0.20000000298023224, "11-17-0": 0.20000000298023224, "11-18-0": 0.0, "11-19-0": 0.4000000059604645, "11-19-1": 0.10000000149011612, "11-20-0": 0.30000001192092896, "11-21-0": 0.699999988079071}, "number_of_words": {"11-0-0": 9, "11-1-0": 31, "11-1-1": 22, "11-1-2": 19, "11-1-3": 42, "11-2-0": 6, "11-3-0": 10, "11-3-1": 15, "11-4-0": 7, "11-5-0": 11, "11-6-0": 11, "11-7-0": 13, "11-8-0": 7, "11-8-1": 19, "11-8-2": 9, "11-9-0": 7, "11-9-1": 14, "11-9-2": 4, "11-10-0": 7, "11-11-0": 24, "11-11-1": 7, "11-11-2": 5, "11-11-3": 4, "11-11-4": 1, "11-11-5": 4, "11-11-6": 30, "11-11-7": 1, "11-12-0": 20, "11-12-1": 7, "11-12-2": 19, "11-13-0": 10, "11-14-0": 4, "11-14-1": 7, "11-15-0": 6, "11-16-0": 13, "11-16-1": 19, "11-17-0": 3, "11-18-0": 7, "11-19-0": 13, "11-19-1": 21, "11-20-0": 9, "11-21-0": 5}}, "sentiment_score": -0.08636363765055483, "magnitude_score": 12.600000023841858, "number_of_comments": 22, "number_of_sentences": 42, "number_of_words": 502}, "12": {"index": "12", "title": "9. Please rate your level of knowledge in the subject area.", "response_data": {"Choice": {"0": "b) After this event activity. ", "1": "a) Before this event activity."}, "Total": {"0": 45, "1": 44}, "Total points": {"0": 135.0, "1": 106.0}}, "has_comments": true, "comments": {"language": {"12-0": "en", "12-1": "en", "12-2": "en", "12-3": "fr", "12-4": "fr", "12-5": "en", "12-6": "en", "12-7": "en"}, "comment": {"12-0": "Real link did not work.  See my earlier comments.", "12-1": "The combination of panel discussion and practical application was excellent.", "12-2": "You didn't give more time for panelists to answer online questions. May sahre with us if those were dealt with.", "12-3": "Je trouve que lorsque nous avons une présentation traduite, cela change beaucoup la dynamique. Ils font un très bon travail, mais le \"ton\" ne reflète pas l'interlocuteur alors cela rend la présentation plus monotone.", "12-4": "La webdiffusion à mon site (Centre de recherche de Valcartier QC) coupait sans arrêt ce qui rendait impossible de suivre l'événement. J'ai dû utiliser la téléconférence (audio seulement via ligne téléphonique).", "12-5": "In my case it would be a huge learning curve for the implementation of any AI.", "12-6": "I don't know what I don't know. It seems like the process can be quick, but unfortunately experience dictates otherwise. I am nonetheless optimistic and look forward to going through it.", "12-7": "We need more events on this subject and maybe more detailed and technical for non-specialist employees"}, "sentiment_score": {"12-0": -0.30000001192092896, "12-1": 0.8999999761581421, "12-2": 0.0, "12-3": 0.10000000149011612, "12-4": -0.30000001192092896, "12-5": 0.800000011920929, "12-6": 0.0, "12-7": 0.699999988079071}, "magnitude_score": {"12-0": 0.699999988079071, "12-1": 0.8999999761581421, "12-2": 0.5, "12-3": 1.5, "12-4": 0.699999988079071, "12-5": 0.800000011920929, "12-6": 1.2000000476837158, "12-7": 0.699999988079071}, "number_of_sentences": {"12-0": 2, "12-1": 1, "12-2": 2, "12-3": 2, "12-4": 2, "12-5": 1, "12-6": 3, "12-7": 1}, "number_of_words": {"12-0": 9, "12-1": 10, "12-2": 21, "12-3": 36, "12-4": 35, "12-5": 16, "12-6": 33, "12-7": 16}}, "sentences": {"comment_id": {"12-0-0": "12-0", "12-0-1": "12-0", "12-1-0": "12-1", "12-2-0": "12-2", "12-2-1": "12-2", "12-3-0": "12-3", "12-3-1": "12-3", "12-4-0": "12-4", "12-4-1": "12-4", "12-5-0": "12-5", "12-6-0": "12-6", "12-6-1": "12-6", "12-6-2": "12-6", "12-7-0": "12-7"}, "language": {"12-0-0": "en", "12-0-1": "en", "12-1-0": "en", "12-2-0": "en", "12-2-1": "en", "12-3-0": "fr", "12-3-1": "fr", "12-4-0": "fr", "12-4-1": "fr", "12-5-0": "en", "12-6-0": "en", "12-6-1": "en", "12-6-2": "en", "12-7-0": "en"}, "sentence": {"12-0-0": "Real link did not work.", "12-0-1": "See my earlier comments.", "12-1-0": "The combination of panel discussion and practical application was excellent.", "12-2-0": "You didn't give more time for panelists to answer online questions.", "12-2-1": "May sahre with us if those were dealt with.", "12-3-0": "Je trouve que lorsque nous avons une présentation traduite, cela change beaucoup la dynamique.", "12-3-1": "Ils font un très bon travail, mais le \"ton\" ne reflète pas l'interlocuteur alors cela rend la présentation plus monotone.", "12-4-0": "La webdiffusion à mon site (Centre de recherche de Valcartier QC) coupait sans arrêt ce qui rendait impossible de suivre l'événement.", "12-4-1": "J'ai dû utiliser la téléconférence (audio seulement via ligne téléphonique).", "12-5-0": "In my case it would be a huge learning curve for the implementation of any AI.", "12-6-0": "I don't know what I don't know.", "12-6-1": "It seems like the process can be quick, but unfortunately experience dictates otherwise.", "12-6-2": "I am nonetheless optimistic and look forward to going through it.", "12-7-0": "We need more events on this subject and maybe more detailed and technical for non-specialist employees"}, "sentiment_score": {"12-0-0": -0.699999988079071, "12-0-1": 0.0, "12-1-0": 0.8999999761581421, "12-2-0": -0.30000001192092896, "12-2-1": 0.10000000149011612, "12-3-0": 0.800000011920929, "12-3-1": -0.6000000238418579, "12-4-0": -0.5, "12-4-1": -0.20000000298023224, "12-5-0": 0.800000011920929, "12-6-0": -0.4000000059604645, "12-6-1": -0.20000000298023224, "12-6-2": 0.5, "12-7-0": 0.699999988079071}, "magnitude_score": {"12-0-0": 0.699999988079071, "12-0-1": 0.0, "12-1-0": 0.8999999761581421, "12-2-0": 0.30000001192092896, "12-2-1": 0.10000000149011612, "12-3-0": 0.800000011920929, "12-3-1": 0.6000000238418579, "12-4-0": 0.5, "12-4-1": 0.20000000298023224, "12-5-0": 0.800000011920929, "12-6-0": 0.4000000059604645, "12-6-1": 0.20000000298023224, "12-6-2": 0.5, "12-7-0": 0.699999988079071}, "number_of_words": {"12-0-0": 5, "12-0-1": 4, "12-1-0": 10, "12-2-0": 12, "12-2-1": 9, "12-3-0": 14, "12-3-1": 22, "12-4-0": 23, "12-4-1": 12, "12-5-0": 16, "12-6-0": 9, "12-6-1": 13, "12-6-2": 11, "12-7-0": 16}}, "sentiment_score": 0.23749999422580004, "magnitude_score": 7.0, "number_of_comments": 8, "number_of_sentences": 14, "number_of_words": 176}, "12a": {"index": "12a", "title": "a) Before this event activity.", "response_data": {"Choice": {"0": "High", "1": "Good", "2": "Average", "3": "A Little", "4": "None"}, "Total": {"0": 1, "1": 4, "2": 13, "3": 20, "4": 6}, "%": {"0": 2.27, "1": 9.09, "2": 29.55, "3": 45.45, "4": 13.64}}, "has_comments": false}, "12b": {"index": "12b", "title": "b) After this event activity. ", "response_data": {"Choice": {"0": "High", "1": "Good", "2": "Average", "3": "A Little", "4": "None"}, "Total": {"0": 1, "1": 11, "2": 20, "3": 13, "4": 0}, "%": {"0": 2.22, "1": 24.44, "2": 44.44, "3": 28.89, "4": 0.0}}, "has_comments": false}, "13": {"index": "13", "title": "11. How did you learn about this learning event? (select all that apply)\n ", "response_data": {"Choice": {"0": "Canada School of Public Service Web site", "1": "Email from the Canada School of Public Service", "2": "Promotional document", "3": "Departmental learning resource", "4": "Supervisor or manager", "5": "Colleague", "6": "Event or kiosk", "7": "Client Contact Centre", "8": "GCcampus", "9": "GCpedia", "10": "GCconnex", "11": "Twitter", "12": "YouTube", "13": "LinkedIn", "14": "National Managers Community", "15": "Social media (please specify) | other"}, "Total": {"0": 6, "1": 15, "2": 0, "3": 1, "4": 9, "5": 8, "6": 0, "7": 0, "8": 4, "9": 0, "10": 1, "11": 2, "12": 0, "13": 0, "14": 0, "15": 1}, "%": {"0": 13.95, "1": 34.88, "2": 0.0, "3": 2.33, "4": 20.93, "5": 18.6, "6": 0.0, "7": 0.0, "8": 9.3, "9": 0.0, "10": 2.33, "11": 4.65, "12": 0.0, "13": 0.0, "14": 0.0, "15": 2.33}}, "has_comments": true, "comments": {"language": {"13-0": "en", "13-1": "en", "13-2": "en"}, "comment": {"13-0": "Senior Management", "13-1": "Agency newsletter", "13-2": "Colleague"}, "sentiment_score": {"13-0": 0.0, "13-1": 0.0, "13-2": 0.0}, "magnitude_score": {"13-0": 0.0, "13-1": 0.0, "13-2": 0.0}, "number_of_sentences": {"13-0": 1, "13-1": 1, "13-2": 1}, "number_of_words": {"13-0": 2, "13-1": 2, "13-2": 1}}, "sentences": {"comment_id": {"13-0-0": "13-0", "13-1-0": "13-1", "13-2-0": "13-2"}, "language": {"13-0-0": "en", "13-1-0": "en", "13-2-0": "en"}, "sentence": {"13-0-0": "Senior Management", "13-1-0": "Agency newsletter", "13-2-0": "Colleague"}, "sentiment_score": {"13-0-0": 0.0, "13-1-0": 0.0, "13-2-0": 0.0}, "magnitude_score": {"13-0-0": 0.0, "13-1-0": 0.0, "13-2-0": 0.0}, "number_of_words": {"13-0-0": 2, "13-1-0": 2, "13-2-0": 1}}, "sentiment_score": 0.0, "magnitude_score": 0.0, "number_of_comments": 3, "number_of_sentences": 3, "number_of_words": 5}, "14": {"index": "14", "title": "12a. Your current classification group:\n ", "response_data": {"Choice": {"0": "AD", "1": "ADM", "2": "AG", "3": "AI", "4": "AO", "5": "AR", "6": "AS", "7": "AU", "8": "BI", "9": "CF Brigadier-General", "10": "CF Captain", "11": "CF Colonel", "12": "CF Corporal", "13": "CF Lieutenant", "14": "CF Lieutenant-Colonel", "15": "CF Lieutenant-General", "16": "CF Major", "17": "CF Major-General", "18": "CF Sergeant", "19": "CF Warrant Officer", "20": "CH", "21": "CM", "22": "CO", "23": "CP", "24": "CR", "25": "CS", "26": "CX", "27": "DA", "28": "DM", "29": "DS", "30": "EC", "31": "ED-EDS", "32": "ED-EST", "33": "ED-LAT", "34": "EG", "35": "EL", "36": "EN", "37": "ENG", "38": "ES", "39": "EX", "40": "FB", "41": "FI", "42": "FO", "43": "FS", "44": "FT", "45": "GL", "46": "GR", "47": "GS", "48": "GT", "49": "HR", "50": "HS", "51": "IS", "52": "LA", "53": "LC", "54": "LE", "55": "LES", "56": "LS", "57": "MA", "58": "MD", "59": "MG", "60": "MT", "61": "ND", "62": "NU", "63": "OM", "64": "PC", "65": "PE", "66": "PG", "67": "PH", "68": "PI", "69": "PM", "70": "PS", "71": "RE", "72": "REG", "73": "RO", "74": "SC", "75": "SE", "76": "SG", "77": "SO", "78": "SP", "79": "ST", "80": "Student", "81": "TI", "82": "TR", "83": "UN", "84": "UNI", "85": "WP"}, "Total": {"0": 0, "1": 0, "2": 0, "3": 0, "4": 0, "5": 0, "6": 1, "7": 0, "8": 1, "9": 0, "10": 0, "11": 0, "12": 0, "13": 0, "14": 0, "15": 0, "16": 0, "17": 0, "18": 0, "19": 0, "20": 0, "21": 0, "22": 1, "23": 0, "24": 0, "25": 16, "26": 0, "27": 0, "28": 0, "29": 0, "30": 4, "31": 0, "32": 0, "33": 0, "34": 0, "35": 0, "36": 0, "37": 2, "38": 0, "39": 1, "40": 1, "41": 1, "42": 0, "43": 0, "44": 0, "45": 0, "46": 0, "47": 0, "48": 0, "49": 0, "50": 0, "51": 1, "52": 0, "53": 1, "54": 0, "55": 0, "56": 0, "57": 0, "58": 0, "59": 0, "60": 0, "61": 0, "62": 0, "63": 0, "64": 0, "65": 3, "66": 4, "67": 0, "68": 0, "69": 4, "70": 0, "71": 0, "72": 0, "73": 0, "74": 0, "75": 0, "76": 0, "77": 0, "78": 0, "79": 0, "80": 2, "81": 0, "82": 0, "83": 0, "84": 1, "85": 0}, "%": {"0": 0.0, "1": 0.0, "2": 0.0, "3": 0.0, "4": 0.0, "5": 0.0, "6": 2.27, "7": 0.0, "8": 2.27, "9": 0.0, "10": 0.0, "11": 0.0, "12": 0.0, "13": 0.0, "14": 0.0, "15": 0.0, "16": 0.0, "17": 0.0, "18": 0.0, "19": 0.0, "20": 0.0, "21": 0.0, "22": 2.27, "23": 0.0, "24": 0.0, "25": 36.36, "26": 0.0, "27": 0.0, "28": 0.0, "29": 0.0, "30": 9.09, "31": 0.0, "32": 0.0, "33": 0.0, "34": 0.0, "35": 0.0, "36": 0.0, "37": 4.55, "38": 0.0, "39": 2.27, "40": 2.27, "41": 2.27, "42": 0.0, "43": 0.0, "44": 0.0, "45": 0.0, "46": 0.0, "47": 0.0, "48": 0.0, "49": 0.0, "50": 0.0, "51": 2.27, "52": 0.0, "53": 2.27, "54": 0.0, "55": 0.0, "56": 0.0, "57": 0.0, "58": 0.0, "59": 0.0, "60": 0.0, "61": 0.0, "62": 0.0, "63": 0.0, "64": 0.0, "65": 6.82, "66": 9.09, "67": 0.0, "68": 0.0, "69": 9.09, "70": 0.0, "71": 0.0, "72": 0.0, "73": 0.0, "74": 0.0, "75": 0.0, "76": 0.0, "77": 0.0, "78": 0.0, "79": 0.0, "80": 4.55, "81": 0.0, "82": 0.0, "83": 0.0, "84": 2.27, "85": 0.0}}, "has_comments": false}, "15": {"index": "15", "title": "12b. Your current classification level:\n ", "response_data": {"Choice": {"0": 0, "1": 1, "2": 2, "3": 3, "4": 4, "5": 5, "6": 6, "7": 7, "8": 8, "9": 9, "10": 10, "11": 11, "12": 12}, "Total": {"0": 1, "1": 2, "2": 12, "3": 10, "4": 8, "5": 4, "6": 4, "7": 0, "8": 0, "9": 1, "10": 0, "11": 0, "12": 0}, "%": {"0": 2.38, "1": 4.76, "2": 28.57, "3": 23.81, "4": 19.05, "5": 9.52, "6": 9.52, "7": 0.0, "8": 0.0, "9": 2.38, "10": 0.0, "11": 0.0, "12": 0.0}}, "has_comments": false}, "16": {"index": "16", "title": "13. How long have you been in your current job?\n ", "response_data": {"Choice": {"0": "Less than one year", "1": "1-2 years", "2": "3-5 years", "3": "6-10 years", "4": "10+ years"}, "Total": {"0": 18, "1": 8, "2": 8, "3": 3, "4": 7}, "%": {"0": 40.91, "1": 18.18, "2": 18.18, "3": 6.82, "4": 15.91}}, "has_comments": true, "comments": {"language": {"16-0": "en", "16-1": "en", "16-2": "en", "16-3": "en", "16-4": "en", "16-5": "en"}, "comment": {"16-0": "As an EX it is helpful to understand the possibilities and risks of new technologies and applications/innovations in other industries.  It help vision the possibilities in business model shifts, culture shifts and digital service transformations we need to make in PS.  Appreciate kindly more events in this area.", "16-1": "Change Management: I'd like to listen to a discussion on how the GC is building capacity (communities of practice, focus groups, working groups, learning opportunities, etc.). I'd like to understand the level of commitment from senior management in terms of engaging employees in digital enablement in the GC. For example, examining challenges and successes of talent development, training, leadership. Why aren't digital principles tied to our PMAs? Are there opportunities to encourage more flexible roles and responsibilities with respect to position criteria. Can we reform and modernize our current workforce structure? Are there policy barriers that prevent us from asking more commitment from our employees such as being digital (as a mindset) and thinking of modernization as a continuous cycle of evolution? Why aren't hiring practices more evolved? It would be extremely interesting to understand the investment needed to build our digital capacity along with challenges (perceived or real) such as impacts from union negotiations, collective agreements and our approach to hiring. I find having to constantly explain the benefits in making our data more accessible exhausting. Having to answer questions such as why modernizing our services is important and why enhancing our data state is meaningful. These suggestions are broad but I truly believe that examining the state of our workforce and thinking of how to build capacity (to fit the need of today and tomorrow) is important if we are going to be successful at becoming digitally relevant. The more we automate processes, the more important it is at examining its impact and consequences which require a human analysis.", "16-2": "Suppliers of AI can present how they can help with Government projects.", "16-3": "I look forward to a new batch of similar presentations with the Digital Academy.", "16-4": "Emerging (IT) trends that can help develop/strengthen (future) careers within the public sector.", "16-5": "- How to use AI for financial Agents\n- What skills to be learned to stay tuned with these new technologies"}, "sentiment_score": {"16-0": 0.800000011920929, "16-1": 0.20000000298023224, "16-2": 0.30000001192092896, "16-3": 0.0, "16-4": 0.10000000149011612, "16-5": 0.20000000298023224}, "magnitude_score": {"16-0": 2.5, "16-1": 5.599999904632568, "16-2": 0.30000001192092896, "16-3": 0.0, "16-4": 0.10000000149011612, "16-5": 0.20000000298023224}, "number_of_sentences": {"16-0": 3, "16-1": 13, "16-2": 1, "16-3": 1, "16-4": 1, "16-5": 1}, "number_of_words": {"16-0": 48, "16-1": 273, "16-2": 12, "16-3": 14, "16-4": 17, "16-5": 21}}, "sentences": {"comment_id": {"16-0-0": "16-0", "16-0-1": "16-0", "16-0-2": "16-0", "16-1-0": "16-1", "16-1-1": "16-1", "16-1-2": "16-1", "16-1-3": "16-1", "16-1-4": "16-1", "16-1-5": "16-1", "16-1-6": "16-1", "16-1-7": "16-1", "16-1-8": "16-1", "16-1-9": "16-1", "16-1-10": "16-1", "16-1-11": "16-1", "16-1-12": "16-1", "16-2-0": "16-2", "16-3-0": "16-3", "16-4-0": "16-4", "16-5-0": "16-5"}, "language": {"16-0-0": "en", "16-0-1": "en", "16-0-2": "en", "16-1-0": "en", "16-1-1": "en", "16-1-2": "en", "16-1-3": "en", "16-1-4": "en", "16-1-5": "en", "16-1-6": "en", "16-1-7": "en", "16-1-8": "en", "16-1-9": "en", "16-1-10": "en", "16-1-11": "en", "16-1-12": "en", "16-2-0": "en", "16-3-0": "en", "16-4-0": "en", "16-5-0": "en"}, "sentence": {"16-0-0": "As an EX it is helpful to understand the possibilities and risks of new technologies and applications/innovations in other industries.", "16-0-1": "It help vision the possibilities in business model shifts, culture shifts and digital service transformations we need to make in PS.", "16-0-2": "Appreciate kindly more events in this area.", "16-1-0": "Change Management: I'd like to listen to a discussion on how the GC is building capacity (communities of practice, focus groups, working groups, learning opportunities, etc.).", "16-1-1": "I'd like to understand the level of commitment from senior management in terms of engaging employees in digital enablement in the GC.", "16-1-2": "For example, examining challenges and successes of talent development, training, leadership.", "16-1-3": "Why aren't digital principles tied to our PMAs?", "16-1-4": "Are there opportunities to encourage more flexible roles and responsibilities with respect to position criteria.", "16-1-5": "Can we reform and modernize our current workforce structure?", "16-1-6": "Are there policy barriers that prevent us from asking more commitment from our employees such as being digital (as a mindset) and thinking of modernization as a continuous cycle of evolution?", "16-1-7": "Why aren't hiring practices more evolved?", "16-1-8": "It would be extremely interesting to understand the investment needed to build our digital capacity along with challenges (perceived or real) such as impacts from union negotiations, collective agreements and our approach to hiring.", "16-1-9": "I find having to constantly explain the benefits in making our data more accessible exhausting.", "16-1-10": "Having to answer questions such as why modernizing our services is important and why enhancing our data state is meaningful.", "16-1-11": "These suggestions are broad but I truly believe that examining the state of our workforce and thinking of how to build capacity (to fit the need of today and tomorrow) is important if we are going to be successful at becoming digitally relevant.", "16-1-12": "The more we automate processes, the more important it is at examining its impact and consequences which require a human analysis.", "16-2-0": "Suppliers of AI can present how they can help with Government projects.", "16-3-0": "I look forward to a new batch of similar presentations with the Digital Academy.", "16-4-0": "Emerging (IT) trends that can help develop/strengthen (future) careers within the public sector.", "16-5-0": "- How to use AI for financial Agents\n- What skills to be learned to stay tuned with these new technologies"}, "sentiment_score": {"16-0-0": 0.8999999761581421, "16-0-1": 0.6000000238418579, "16-0-2": 0.8999999761581421, "16-1-0": 0.5, "16-1-1": 0.4000000059604645, "16-1-2": 0.6000000238418579, "16-1-3": -0.10000000149011612, "16-1-4": 0.699999988079071, "16-1-5": 0.0, "16-1-6": -0.30000001192092896, "16-1-7": 0.0, "16-1-8": 0.6000000238418579, "16-1-9": -0.30000001192092896, "16-1-10": 0.5, "16-1-11": 0.5, "16-1-12": 0.4000000059604645, "16-2-0": 0.30000001192092896, "16-3-0": 0.0, "16-4-0": 0.10000000149011612, "16-5-0": 0.20000000298023224}, "magnitude_score": {"16-0-0": 0.8999999761581421, "16-0-1": 0.6000000238418579, "16-0-2": 0.8999999761581421, "16-1-0": 0.5, "16-1-1": 0.4000000059604645, "16-1-2": 0.6000000238418579, "16-1-3": 0.10000000149011612, "16-1-4": 0.699999988079071, "16-1-5": 0.0, "16-1-6": 0.30000001192092896, "16-1-7": 0.0, "16-1-8": 0.6000000238418579, "16-1-9": 0.30000001192092896, "16-1-10": 0.5, "16-1-11": 0.5, "16-1-12": 0.4000000059604645, "16-2-0": 0.30000001192092896, "16-3-0": 0.0, "16-4-0": 0.10000000149011612, "16-5-0": 0.20000000298023224}, "number_of_words": {"16-0-0": 20, "16-0-1": 21, "16-0-2": 7, "16-1-0": 29, "16-1-1": 23, "16-1-2": 11, "16-1-3": 9, "16-1-4": 15, "16-1-5": 9, "16-1-6": 33, "16-1-7": 7, "16-1-8": 36, "16-1-9": 15, "16-1-10": 20, "16-1-11": 45, "16-1-12": 21, "16-2-0": 12, "16-3-0": 14, "16-4-0": 17, "16-5-0": 21}}, "sentiment_score": 0.2666666718820731, "magnitude_score": 8.699999921023846, "number_of_comments": 6, "number_of_sentences": 20, "number_of_words": 385}, "17": {"index": "17", "title": "I allow my comments to be used anonymously for promotional purposes\n ", "response_data": {"Choice": {"0": "Yes", "1": "No"}, "Total": {"0": 24, "1": 21}, "%": {"0": 53.33, "1": 46.67}}, "has_comments": false}}, "number_of_sections": 5}